TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h



#include "stm32wbxx_hal.h"
#include "../../WROS/Include/general.h"

#ifndef WROS_REGISTER_H
#define WROS_REGISTER_H


typedef enum IRQn
{
	/******  Cortex-M4 Processor Exceptions Numbers ***************************************************************/
	Cortex_M4_NonMaskableInt_IRQn   = -14,       /*!< 2 Non Maskable Interrupt                                    */
	Cortex_M4_HardFault_IRQn        = -13,       /*!< 3 Cortex-M4 Hard Fault Interrupt                            */
	
	Cortex_M4_MemoryManagement_IRQn = -12,       /*!< 4 Cortex-M4 Memory Management Interrupt                     */
	Cortex_M4_BusFault_IRQn         = -11,       /*!< 5 Cortex-M4 Bus Fault Interrupt                             */
	Cortex_M4_UsageFault_IRQn       = -10,       /*!< 6 Cortex-M4 Usage Fault Interrupt                           */
	NULL_9_IRQn 					= -9,
	
	NULL_8_IRQn 					= -8,
	NULL_7_IRQn 					= -7,
	NULL_6_IRQn 					= -6,
	Cortex_M4_SVCall_IRQn           = -5,        /*!< 11 Cortex-M4 SV Call Interrupt                              */
	
	Cortex_M4_DebugMonitor_IRQn     = -4,        /*!< 12 Cortex-M4 Debug Monitor Interrupt                        */
	NULL_3_IRQn						= -3,
	Cortex_M4_PendSV_IRQn           = -2,        /*!< 14 Cortex-M4 Pend SV Interrupt                              */
	Cortex_M4_SysTick_IRQn          = -1,        /*!< 15 Cortex-M4 System Tick Interrupt                          */

	/******  TMPM470 Specific Interrupt Numbers *******************************************************************/
	ExternalInterrupts_IRQn_0			= 0,
	ExternalInterrupts_IRQn_1			= 1,
	ExternalInterrupts_IRQn_2			= 2,
	ExternalInterrupts_IRQn_3			= 3,
	ExternalInterrupts_IRQn_4			= 4,
	ExternalInterrupts_IRQn_5			= 5,
	ExternalInterrupts_IRQn_6			= 6,
	ExternalInterrupts_IRQn_7			= 7,
	ExternalInterrupts_IRQn_8			= 8,
	ExternalInterrupts_IRQn_9			= 9,
	ExternalInterrupts_IRQn_10			= 10,
	ExternalInterrupts_IRQn_11			= 11,
	ExternalInterrupts_IRQn_12			= 12,
	ExternalInterrupts_IRQn_13			= 13,
	ExternalInterrupts_IRQn_14			= 14,
	ExternalInterrupts_IRQn_15			= 15,
	ExternalInterrupts_IRQn_16			= 16,
	ExternalInterrupts_IRQn_17			= 17,
	ExternalInterrupts_IRQn_18			= 18,
	ExternalInterrupts_IRQn_19			= 19,
	ExternalInterrupts_IRQn_20			= 20,
	ExternalInterrupts_IRQn_21			= 21,
	ExternalInterrupts_IRQn_22			= 22,
	ExternalInterrupts_IRQn_23			= 23,
	ExternalInterrupts_IRQn_24			= 24,
	ExternalInterrupts_IRQn_25			= 25,
	ExternalInterrupts_IRQn_26			= 26,
	ExternalInterrupts_IRQn_27			= 27,
	ExternalInterrupts_IRQn_28			= 28,
	ExternalInterrupts_IRQn_29			= 29,
	ExternalInterrupts_IRQn_30			= 30,
	ExternalInterrupts_IRQn_31			= 31,
	ExternalInterrupts_IRQn_32			= 32,
	ExternalInterrupts_IRQn_33			= 33,
	ExternalInterrupts_IRQn_34			= 34,
	ExternalInterrupts_IRQn_35			= 35,
	ExternalInterrupts_IRQn_36			= 36,
	ExternalInterrupts_IRQn_37			= 37,
	ExternalInterrupts_IRQn_38			= 38,
	ExternalInterrupts_IRQn_39			= 39,
	ExternalInterrupts_IRQn_40			= 40,
	ExternalInterrupts_IRQn_41			= 41,
	ExternalInterrupts_IRQn_42			= 42,
	ExternalInterrupts_IRQn_43			= 43,
	ExternalInterrupts_IRQn_44			= 44,
	ExternalInterrupts_IRQn_45			= 45,
	ExternalInterrupts_IRQn_46			= 46,
	ExternalInterrupts_IRQn_47			= 47,
	ExternalInterrupts_IRQn_48			= 48,
	ExternalInterrupts_IRQn_49			= 49,
	ExternalInterrupts_IRQn_50			= 50,
	ExternalInterrupts_IRQn_51			= 51,
	ExternalInterrupts_IRQn_52			= 52,
	ExternalInterrupts_IRQn_53			= 53,
	ExternalInterrupts_IRQn_54			= 54,
	ExternalInterrupts_IRQn_55			= 55,
	ExternalInterrupts_IRQn_56			= 56,
	ExternalInterrupts_IRQn_57			= 57,
	ExternalInterrupts_IRQn_58			= 58,
	ExternalInterrupts_IRQn_59			= 59,
	ExternalInterrupts_IRQn_60			= 60,
	ExternalInterrupts_IRQn_61			= 61,
	ExternalInterrupts_IRQn_62			= 62,
	ExternalInterrupts_IRQn_63			= 63,
	ExternalInterrupts_IRQn_64			= 64,
	ExternalInterrupts_IRQn_65			= 65,
	ExternalInterrupts_IRQn_66			= 66,
	ExternalInterrupts_IRQn_67			= 67,
	ExternalInterrupts_IRQn_68			= 68,
	ExternalInterrupts_IRQn_69			= 69,
	ExternalInterrupts_IRQn_70			= 70,
	ExternalInterrupts_IRQn_71			= 71,
	ExternalInterrupts_IRQn_72			= 72,
	ExternalInterrupts_IRQn_73			= 73,
	ExternalInterrupts_IRQn_74			= 74,
	ExternalInterrupts_IRQn_75			= 75,
	ExternalInterrupts_IRQn_76			= 76,
	ExternalInterrupts_IRQn_77			= 77,
	ExternalInterrupts_IRQn_78			= 78,
	ExternalInterrupts_IRQn_79			= 79,
	ExternalInterrupts_IRQn_80			= 80,
	ExternalInterrupts_IRQn_81			= 81,
	ExternalInterrupts_IRQn_82			= 82,
	ExternalInterrupts_IRQn_83			= 83,
	ExternalInterrupts_IRQn_84			= 84,
	ExternalInterrupts_IRQn_85			= 85,
	ExternalInterrupts_IRQn_86			= 86,
	ExternalInterrupts_IRQn_87			= 87,
	ExternalInterrupts_IRQn_88			= 88,
	ExternalInterrupts_IRQn_89			= 89,
	ExternalInterrupts_IRQn_90			= 90,
} WROS_IRQn_Type;


typedef struct {
	uint32_t RESERVED;					// 0xE000E000
	uint32_t ICTR;						// 0xE000E004: (R/ ) Interrupt Controller Type Register, ICTR

	union {
		volatile uint32_t ACTLR;			// 0xE000E008: (R/W) Auxiliary Control Register, ACTLR on page 4-5
		struct ACTLR_Register {
			uint32_t DISMCYCINT	: 1;		
			uint32_t DISDEFWBUF	: 1;		
			uint32_t DISFOLD		: 1;	// Disables folding of IT instructions.
			uint32_t RESERVED0	: 5;
			uint32_t DISOOFP		: 1;	// Disables floating point instructions completing out of order with respect to integer instructions.
			uint32_t DISFPCA		: 1;	// Disables lazy stacking of floating point context. See Exceptions on page 7-8 for more information.
		} ACTLR_register;
	};
	
	struct SYSTICK_Register
	{
		uint32_t RESERVED0;				// 0xE000E00C:
		union
		{
			uint32_t STCSR; 				// 0xE000E010: (R/W) SysTick Control and Status Register
			struct STCSR_Register
			{
				uint32_t ENABLE		: 1;		// Request CORTEX_M reset
				uint32_t TICKINT	: 1;		// Clear all abnormal Info
				uint32_t CLKSOURCE	: 1;		// Request MCU reset
				uint32_t RESERVED_0	: 13;
				uint32_t COUNTFLAG	: 1;		// Priority grouping
				uint32_t RESERVED_1	: 15;
			} STCSR_register;
		};

		union
		{
			uint32_t STRVR; 				// 0xE000E014: (R/W) SysTick Reload Value Register
			struct STRVR_Register
			{
				uint32_t RELOAD		: 24;	
				uint32_t RESERVED_0	: 8;
			} STRVR_register;
		};
		
		union
		{
			uint32_t STCVR; 				// 0xE000E018: (R/W) SysTick Current Value Register 	
			struct STCVR_Register
			{
				uint32_t CURRENT	: 24;	
				uint32_t RESERVED_0	: 8;
			} STCVR_register;
		};
		
		union
		{
			uint32_t STCR;	//	STCALIB 	// 0xE000E01C: (R/ ) SysTick Calibration Value Register 	
			struct STCR_Register
			{
				uint32_t TENMS		: 24;
				uint32_t RESERVED_0	: 6;
				uint32_t SKEW		: 1;
				uint32_t NOREF		: 1;
			} STCR_register;
		};
		uint32_t RESERVED1[56];			// 0xE000E020: ( / ) SysTick Current Value Register
	}SYSTICK_register;
	
	struct NVIC_Register {

		uint32_t ISER[8];					// 0xE000E100: (R/W) Interrupt Set Enable Register
		uint32_t RESERVED2[24];							
		uint32_t ICER[8];					// 0xE000E180: (R/W) Interrupt Clear Enable Register
		uint32_t RESERVED3[24]; 							
		uint32_t ISPR[8];					// 0xE000E200: (R/W) Interrupt Set Pending Register
		uint32_t RESERVED4[24];							
		uint32_t ICPR[8];					// 0xE000E280: (R/W) Interrupt Clear Pending Register
		uint32_t RESERVED5[24];							
		uint32_t IABR[8];					// 0xE000E300: (R/W) Interrupt Active bit Register
		uint32_t RESERVED6[56];
		uint8_t IPR[240];					// 0xE000E400: (R/W) Interrupt Active bit Register
		uint32_t RESERVED7[516];			// 0xE000E4F0
		
		union {
			volatile uint32_t CPUID;		// 0xE000ED00: (R/ ) CPU ID Base Register	// Reset 0x410FC240	
			struct CPUID_Register {
				uint32_t REVISION		: 4;		// Indicates patch release: 0x0 = Patch 0.
				uint32_t PARTNO			: 12;		// Indicates part number: 0xC24 = Cortex-M4, 0xC23 = Cortex-M3
				uint32_t Constant		: 4;		// Reads as 0xF
				uint32_t VARIANT		: 4;		// Indicates processor revision: 0x0 = Revision 0
				uint32_t IMPLEMENTER	: 8;		// Indicates implementor: 0x41 = ARM
			} CPUID_register;
		};
		
		uint32_t ICSR;					// 0xE000ED04: (R/W)  Interrupt Control State Register
		uint32_t VTOR;					// 0xE000ED08: (R/W)  Vector Table Offset Register


		union {
			uint32_t AIRCR;					// 0xE000ED0C: (R/W)  Application Interrupt / Reset Control Register
			struct AIRCR_Register {
				uint32_t VECTRESET		: 1;		// Request CORTEX_M reset
				uint32_t VECTCLRACTIVE	: 1;		// Clear all abnormal Info
				uint32_t SYSRESETREQ	: 1;		// Request MCU reset
				uint32_t RESERVED0		: 5;
				uint32_t PRIGROUP		: 3;		// Priority grouping
				uint32_t RESERVED1		: 4;
				uint32_t ENDIANESS		: 1;		// READ ONLY		1 = MSB, 0 = LSB
				uint32_t VECTKEY		: 16;		// OPER Key			WRITE: 0x05FA, READ: 0xFA05
			} AIRCR_register;
		};
		
