TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
		uint32_t SCR;						// 0xE000ED10: (R/W)  System Control Register
		uint32_t CCR;						// 0xE000ED14: (R/W)  Configuration Control Register 
		uint8_t SHP[12];					// 0xE000ED18: (R/W)  System Handlers Priority Registers (4-7, 8-11, 12-15) 
		uint32_t SHCSR;					// 0xE000ED24: (R/W)  System Handler Control and State Register			 
		uint32_t CFSR;					// 0xE000ED28: (R/W)  Configurable Fault Status Register 				   
		uint32_t HFSR;					// 0xE000ED2C: (R/W)  Hard Fault Status Register 						   
		uint32_t DFSR;					// 0xE000ED30: (R/W)  Debug Fault Status Register						   
		uint32_t MMFAR;					// 0xE000ED34: (R/W)  Mem Manage Address Register						   
		uint32_t BFAR;					// 0xE000ED38: (R/W)  Bus Fault Address Register 						   
		uint32_t AFSR;					// 0xE000ED3C: (R/W)  Auxiliary Fault Status Register					   
		uint32_t PFR[2];					// 0xE000ED40: (R/ )  Processor Feature Register 						   
		uint32_t DFR;						// 0xE000ED48: (R/ )  Debug Feature Register 							   
		uint32_t ADR;						// 0xE000ED4C: (R/ )  Auxiliary Feature Register 						   
		uint32_t MMFR[4];					// 0xE000ED50: (R/ )  Memory Model Feature Register						
		uint32_t ISAR[5];					// 0xE000ED60: (R/ )  ISA Feature Register								   
		uint32_t RESERVED8[5];
		uint32_t CPACR;					// 0xE000ED88: (R/W)  Coprocessor access register鍗忓鐞嗗櫒璁块棶瀵勫瓨鍣紙M4 FPU鐩稿叧锛孧3鏃狅級
		uint32_t RESERVED9;				// 0xE000ED8C
		uint32_t MPU_TYPE;				// 0xE000ED90: (R/ )  MPU Type Register
		uint32_t MPU_CTRL;				// 0xE000ED94: (R/W)  MPU Control Register
		uint32_t MPU_RNR;					// 0xE000ED98: (R/W)  MPU Region Number Register
		uint32_t MPU_RBAR;				// 0xE000ED9C: (R/W)  MPU Region Number Register
		uint32_t MPU_RASR;				// 0xE000EDA0: (R/W)  MPU Region Number Register
		uint32_t MPU_RBAR_A1;				// 0xE000EDA4: (R/W)  MPU alias registers
		uint32_t MPU_RASR_A1;				// 0xE000EDA8: (R/W)  
		uint32_t MPU_RBAR_A2;				// 0xE000EDAC: (R/W)  
		uint32_t MPU_RASR_A2;				// 0xE000EDB0: (R/W)  
		uint32_t MPU_RBAR_A3;				// 0xE000EDB4: (R/W)  
		uint32_t MPU_RASR_A3;				// 0xE000EDB8: (R/W)  
		uint32_t RESERVED10[81];			// 0xE000EDBC
		
		uint32_t STIR;					// 0xE000EF00: ( /W)  Software Triggered Interrupt Register
	}NVIC_register;
} WROS_CORTEX_M_Typedef;


/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/




// 				FLASH



typedef struct {
    // Flash 璁块棶鎺у埗瀵勫瓨鍣? (FLASH_ACR)
    union {
        __IO uint32_t ACR;                /*!< Flash memory access control register        */
        struct ACR_Register {
            uint32_t LATENCY       : 3;    /*!< Latency (Number of wait states)             */
            uint32_t RESERVED0     : 5;    /*!< Reserved bits                                */
            uint32_t PRFTEN        : 1;    /*!< Prefetch enable                             */
            uint32_t ICEN          : 1;    /*!< Instruction cache enable                    */
            uint32_t DCEN          : 1;    /*!< Data cache enable                           */
            uint32_t ICRST         : 1;    /*!< Instruction cache reset                     */
            uint32_t DCRST         : 1;    /*!< Data cache reset                            */
            uint32_t RESERVED1     : 2;    /*!< Reserved bits                                */
            uint32_t PES           : 1;    /*!< CPU1 program/erase suspend request          */
            uint32_t EMPTY         : 1;    /*!< Flash memory User area empty                */
            uint32_t RESERVED2     : 15;   /*!< Reserved bits                                */
        } ACR_register;
    };

    uint32_t RESERVED4;                /*!< Reserved space (0x004 - 0x007)              */

    // Flash 瀵嗛挜瀵勫瓨鍣? (FLASH_KEYR)
    __IO uint32_t KEYR;                  /*!< Flash memory key register                    */

    // Flash 閫夐」瀵嗛挜瀵勫瓨鍣? (FLASH_OPTKEYR)
    __IO uint32_t OPTKEYR;               /*!< Flash memory option key register            */

    // Flash 鐘舵?佸瘎瀛樺櫒 (FLASH_SR)
    union {
        __IO uint32_t SR;                 /*!< Flash memory status register                 */
        struct SR_Register {
            uint32_t EOP           : 1;    /*!< End of operation                            */
            uint32_t OPERR         : 1;    /*!< Operation error                             */
            uint32_t RESERVED5     : 1;    /*!< Reserved bit                                */
            uint32_t PROGERR       : 1;    /*!< Programming error                           */
            uint32_t WRPERR        : 1;    /*!< Write protection error                      */
            uint32_t PGAERR        : 1;    /*!< Programming alignment error                 */
            uint32_t SIZERR        : 1;    /*!< Size error                                  */
            uint32_t PGSERR        : 1;    /*!< Programming sequence error                  */
            uint32_t MISERR        : 1;    /*!< Fast programming data miss error            */
            uint32_t FASTERR       : 1;    /*!< Fast programming error                      */
            uint32_t RESERVED6     : 3;    /*!< Reserved bits                               */
            uint32_t OPTNV         : 1;    /*!< User Option OPTVAL indication               */
            uint32_t RDERR     		 : 1;    /*!< Reserved bits                               */
            uint32_t OPTVERR       : 1;    /*!< Option and Engineering bits loading validity error */
            uint32_t BSY           : 1;    /*!< Busy                                        */
            uint32_t RESERVED8     : 1;    /*!< Reserved bit                                */
            uint32_t CFGBSY        : 1;    /*!< Programming or erase configuration busy     */
            uint32_t PESD          : 1;    /*!< Programming / erase operation suspended     */
            uint32_t RESERVED9     : 12;   /*!< Reserved bits                               */
        } SR_register;
    };

    // Flash 鎺у埗瀵勫瓨鍣? (FLASH_CR)
    union {
        __IO uint32_t FLASH_CR;                 /*!< Flash memory control register                */
        struct FLASH_CR_Register {
            uint32_t PG            : 1;    /*!< Programming                                 */
            uint32_t PER           : 1;    /*!< Page erase                                  */
            uint32_t MER           : 1;    /*!< Mass erase                                  */
            uint32_t PNB           : 8;    /*!< Page number selection                       */
            uint32_t RESERVED11    : 5;    /*!< Reserved bits                               */
            uint32_t STRT          : 1;    /*!< Start                                       */
            uint32_t OPTSTRT       : 1;    /*!< Options modification start                  */
            uint32_t FSTPG         : 1;    /*!< Fast programming                            */
            uint32_t RESERVED12    : 5;    /*!< Reserved bits                               */
            uint32_t EOPIE         : 1;    /*!< End of operation interrupt enable           */
            uint32_t ERRIE         : 1;    /*!< Error interrupt enable                      */
            uint32_t RDERRIE       : 1;    /*!< PCROP read error interrupt enable           */
            uint32_t OBL_LAUNCH    : 1;    /*!< Forces the option byte loading              */
            uint32_t RESERVED13    : 2;    /*!< Reserved bits                                */
            uint32_t OPTLOCK       : 1;    /*!< Options Lock                                */
            uint32_t LOCK          : 1;    /*!< FLASH_CR Lock                               */
        } FLASH_CR_register;
    };

    // Flash ECC 瀵勫瓨鍣? (FLASH_ECCR)
    union {
        __IO uint32_t ECCR;               /*!< Flash memory ECC register                   */
        struct ECCR_Register {
            uint32_t ADDR_ECC      : 17;   /*!< ECC fail double-word address                */
            uint32_t RESERVED14    : 3;    /*!< Reserved bits                               */
            uint32_t SYSF_ECC      : 1;    /*!< System Flash memory ECC fail                */
            uint32_t RESERVED15    : 3;    /*!< Reserved bits                               */
            uint32_t ECCIE         : 1;    /*!< ECC correction interrupt enable             */
            uint32_t RESERVED16    : 1;    /*!< Reserved bit                                */
            uint32_t CPUID         : 3;    /*!< CPU identification                          */
            uint32_t RESERVED17    : 1;    /*!< Reserved bit                                */
            uint32_t ECCC          : 1;    /*!< ECC correction                              */
            uint32_t ECCD          : 1;    /*!< ECC detection                               */
        } ECCR_register;
    };

