TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    uint32_t RESERVED18;                /*!< Reserved space (0x01C - 0x01F)              */

    // Flash 閫夐」瀵勫瓨鍣? (FLASH_OPTR)
    union {
        __IO uint32_t OPTR;               /*!< Flash memory option register                */
        struct OPTR_Register {
            uint32_t RDP           : 8;    /*!< Read protection level                       */
            uint32_t ESE           : 1;    /*!< ESE                                         */
            uint32_t BOR_LEV       : 3;    /*!< BOR level                                   */
            uint32_t nRST_STOP     : 1;    /*!< nRST_STOP                                   */
            uint32_t nRST_STDBY    : 1;    /*!< nRST_STDBY                                  */
            uint32_t nRST_SHDW     : 1;    /*!< nRST_SHDW                                   */
            uint32_t RESERVED21    : 1;    /*!< Reserved bit                                */
            uint32_t IWDG_SW       : 1;    /*!< Independent watchdog selection              */
            uint32_t IWDG_STOP     : 1;    /*!< Independent watchdog counter freeze in stop mode */
            uint32_t IWDG_STDBY    : 1;    /*!< Independent watchdog counter freeze in Standby mode */
            uint32_t WWDG_SW       : 1;    /*!< Window watchdog selection                   */
            uint32_t RESERVED20    : 3;    /*!< Reserved bits                               */
            uint32_t nBOOT1        : 1;    /*!< Boot configuration                          */
            uint32_t SRAM2_PE      : 1;    /*!< SRAM2 parity check enable                   */
            uint32_t SRAM2_RST     : 1;    /*!< SRAM2 and PKA RAM Erase when system reset   */
            uint32_t nSWBOOT0      : 1;    /*!< Software BOOT0 selection                    */
            uint32_t nBOOT0        : 1;    /*!< nBOOT0 option bit                           */
            uint32_t RESERVED19    : 1;    /*!< Reserved bit                                */
            uint32_t AGC_TRIM      : 3;    /*!< Radio automatic gain control trimming       */
        } OPTR_register;
    };

    // Flash PCROP 鍖哄煙 A 璧峰鍦板潃瀵勫瓨鍣? (FLASH_PCROP1ASR)
    union {
        __IO uint32_t PCROP1A_SR;          /*!< Flash memory PCROP zone A Start address register */
        struct PCROP1A_SR_Register {
            uint32_t PCROP1A_STRT  : 9;    /*!< PCROP1A area start offset                   */
            uint32_t RESERVED23    : 23;   /*!< Reserved bits                                */
        } PCROP1A_SR_register;
    };

    // Flash PCROP 鍖哄煙 A 缁撴潫鍦板潃瀵勫瓨鍣? (FLASH_PCROP1AER)
    union {
        __IO uint32_t PCROP1A_ER;          /*!< Flash memory PCROP zone A End address register */
        struct PCROP1A_ER_Register {
            uint32_t PCROP1A_END   : 9;    /*!< PCROP1A area end offset                     */
            uint32_t RESERVED24    : 22;   /*!< Reserved bits                                */
						uint32_t PCROP_RDP	   : 1;    /*!< PCROP area preserved when RDP level decreased */
        } PCROP1A_ER_register;
    };

    // Flash WRP 鍖哄煙 A 鍦板潃瀵勫瓨鍣? (FLASH_WRP1AR)
    union {
        __IO uint32_t WRP1A_R;             /*!< Flash memory WRP area A address register    */
        struct WRP1AR_Register {
            uint32_t WRP1A_STRT    : 8;    /*!< WRP first area "A" start offset             */
            uint32_t RESERVED25    : 8;    /*!< Reserved bits                                */
            uint32_t WRP1A_END     : 8;    /*!< WRP first area "A" end offset               */
						uint32_t RESERVED26    : 8;    /*!< Reserved bits								 */
        } WRP1A_R_register;
    };

    // Flash WRP 鍖哄煙 B 鍦板潃瀵勫瓨鍣? (FLASH_WRP1BR)
    union {
        __IO uint32_t WRP1B_R;             /*!< Flash memory WRP area B address register    */
        struct WRP1B_R_Register {
            uint32_t WRP1B_STRT    : 8;    /*!< WRP second area "B" start offset            */
            uint32_t RESERVED27    : 8;    /*!< Reserved bits                                */
            uint32_t WRP1B_END     : 8;    /*!< WRP second area "B" end offset              */
						uint32_t RESERVED28    : 8;    /*!< Reserved bits								 */
        } WRP1B_R_register;
    };

    // Flash PCROP 鍖哄煙 B 璧峰鍦板潃瀵勫瓨鍣? (FLASH_PCROP1BSR)
    union {
        __IO uint32_t PCROP1B_SR;          /*!< Flash memory PCROP zone B Start address register */
        struct PCROP1B_SR_Register {
            uint32_t PCROP1B_STRT  : 9;    /*!< PCROP1B area start offset                   */
            uint32_t RESERVED30    : 23;   /*!< Reserved bits                                */
        } PCROP1B_SR_register;
    };

    // Flash PCROP 鍖哄煙 B 缁撴潫鍦板潃瀵勫瓨鍣? (FLASH_PCROP1BER)
    union {
        __IO uint32_t PCROP1B_ER;          /*!< Flash memory PCROP zone B End address register */
        struct PCROP1B_ER_Register {
            uint32_t PCROP1B_END   : 9;    /*!< PCROP1B area end offset                     */
            uint32_t RESERVED31    : 23;   /*!< Reserved bits                                */
        } PCROP1B_ER_register;
    };

    // Flash IPCC 閭鏁版嵁缂撳啿鍖哄湴鍧?瀵勫瓨鍣? (FLASH_IPCCBR)
    union {
        __IO uint32_t IPCCBR;             /*!< Flash memory IPCC mailbox data buffer address register */
        struct IPCCBR_Register {
            uint32_t IPCCBA        : 14;   /*!< IPCC mailbox data buffer base address offset */
            uint32_t RESERVED32    : 18;   /*!< Reserved bits                                */
        } IPCCBR_register;
    };

    uint32_t RESERVED33[7];              /*!< Reserved space (0x040 - 0x07F)              */

    // Flash CPU2 璁块棶鎺у埗瀵勫瓨鍣? (FLASH_C2ACR)
    union {
        __IO uint32_t C2ACR;              /*!< Flash memory CPU2 access control register   */
        struct C2ACR_Register {
            uint32_t RESERVED38    : 8;    /*!< Reserved bits                                */
            uint32_t PRFTEN        : 1;    /*!< CPU2 Prefetch enable                        */
            uint32_t ICEN          : 1;    /*!< CPU2 Instruction cache enable               */
            uint32_t RESERVED39    : 1;    /*!< Reserved bit                                */
            uint32_t ICRST         : 1;    /*!< CPU2 Instruction cache reset                */
            uint32_t RESERVED40    : 3;   /*!< Reserved bits                                */
            uint32_t PES           : 1;    /*!< CPU2 program/erase suspend request          */
						uint32_t RESERVED41    : 16;   /*!< Reserved bits								 */
        } C2ACR_register;
    };

