TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    // Flash CPU2 鐘舵?佸瘎瀛樺櫒 (FLASH_C2SR)
    union {
        __IO uint32_t C2SR;               /*!< Flash memory CPU2 status register            */
        struct C2SR_Register {
            uint32_t EOP           : 1;    /*!< End of operation (0: No, 1: Yes)            */
            uint32_t OPERR         : 1;    /*!< Operation error (0: No, 1: Yes)             */
            uint32_t RESERVED41    : 1;    /*!< Reserved bit                                */
            uint32_t PROGERR       : 1;    /*!< Programming error (0: No, 1: Yes)           */
            uint32_t WRPERR        : 1;    /*!< Write protection error (0: No, 1: Yes)      */
            uint32_t PGAERR        : 1;    /*!< Programming alignment error (0: No, 1: Yes) */
            uint32_t SIZERR        : 1;    /*!< Size error (0: No, 1: Yes)                  */
            uint32_t PGSERR        : 1;    /*!< Programming sequence error (0: No, 1: Yes)  */
            uint32_t MISSERR       : 1;    /*!< Fast programming data miss error            */
            uint32_t FASTERR       : 1;    /*!< Fast programming error                      */
            uint32_t RESERVED42    : 4;    /*!< Reserved bits                               */
            uint32_t RDERR         : 1;    /*!< User Option OPTVAL indication               */
            uint32_t RESERVED43    : 1;    /*!< Reserved bits                               */
            uint32_t BSY           : 1;    /*!< Busy flag (0: Ready, 1: Busy)               */
            uint32_t RESERVED44    : 1;    /*!< Reserved bit                                */
            uint32_t CFGBSY        : 1;    /*!< Configuration busy (0: Ready, 1: Busy)      */
            uint32_t PESD          : 1;    /*!< Program/erase suspended (0: No, 1: Yes)     */
            uint32_t RESERVED45    : 12;   /*!< Reserved bits                               */
        } C2SR_register;
    };

    // Flash CPU2 鎺у埗瀵勫瓨鍣? (FLASH_C2CR)
    union {
        __IO uint32_t FLASH_C2CR;               /*!< Flash memory CPU2 control register           */
        struct FLASH_C2CR_Register {
            uint32_t PG            : 1;    /*!< Programming enable (0: Disable, 1: Enable)  */
            uint32_t PER           : 1;    /*!< Page erase enable (0: Disable, 1: Enable)   */
            uint32_t MER           : 1;    /*!< Mass erase enable (0: Disable, 1: Enable)   */
            uint32_t PNB           : 8;    /*!< Page number selection (0~255)               */
            uint32_t RESERVED46    : 5;    /*!< Reserved bits                               */
            uint32_t STRT          : 1;    /*!< Start operation (0: No, 1: Trigger)         */
            uint32_t RESERVED47    : 1;    /*!< Reserved bits                               */
            uint32_t FSTPG         : 1;    /*!< Fast programming enable                     */
            uint32_t RESERVED48    : 5;    /*!< Reserved bits                               */
            uint32_t EOPIE         : 1;    /*!< End of operation interrupt enable           */
            uint32_t ERRIE         : 1;    /*!< Error interrupt enable                      */
            uint32_t RDERRIE       : 1;    /*!< PCROP read error interrupt enable           */
            uint32_t RESERVED49    : 5;    /*!< Reserved bits                               */
        } FLASH_C2CR_register;
    };
		
    uint32_t RESERVED34[6];              /*!< Reserved space (0x040 - 0x07F)              */
    // 瀹夊叏 Flash 璧峰鍦板潃瀵勫瓨鍣? (FLASH_SFR)
    union {
        __IO uint32_t SFR;                /*!< Secure Flash memory start address register  */
        struct SFR_Register {
            uint32_t SPSA          : 8;    /*!< SPSA                                        */
            uint32_t FSD           : 1;    /*!< FSD                                         */
            uint32_t RESERVED34    : 3;    /*!< Reserved bits                                */
            uint32_t DDS           : 1;    /*!< Disable CPU2 Debug access                   */
            uint32_t RESERVED36    : 19;   /*!< Reserved bits                                */
        } SFR_register;
    };

    // Flash 瀹夊叏 SRAM2 璧峰鍦板潃鍜? CPU2 澶嶄綅鍚戦噺瀵勫瓨鍣? (FLASH_SRRVR)
    union {
        __IO uint32_t SRRVR;              /*!< Flash memory secure SRAM2 start address and CPU2 reset vector register */
        struct SRRVR_Register {
            uint32_t SBRV          : 18;   /*!< CPU2 boot reset vector                      */
            uint32_t SBRSA         : 5;    /*!< Secure non-backup SRAM2b start address      */
            uint32_t BRSD          : 1;    /*!< backup SRAM2a security disable              */
            uint32_t RESERVED37    : 1;    /*!< Reserved bit                                */
            uint32_t SNBRSA        : 5;    /*!< Secure backup SRAM2a start address          */
            uint32_t NBRSD         : 1;    /*!< non-backup SRAM2b security disable          */
            uint32_t C2OPT         : 1;    /*!< CPU2 boot reset vector memory selection     */
        } SRRVR_register;
    };

} WROS_FLASH_TypeDef;







/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/





// 				RCC





