TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
typedef struct {
    // RCC 鏃堕挓鎺у埗瀵勫瓨鍣? (RCC_CR)   					
	  // 0x5800 0000
    union {
        __IO uint32_t RCC_CR;                /*!< RCC clock control register                  */
        struct RCC_CR_Register {
			uint32_t MSION         : 1;    /*!< HSI oscillator enable                       */
			uint32_t MSIRDY        : 1;    /*!< HSI oscillator ready flag                   */
			uint32_t MSIPLLEN      : 1;    /*!< MSI PLL enable                              */
			uint32_t Reserved_0    : 1;    /*!< Reserved bit                                */
			uint32_t MSIRANGE      : 4;    /*!< MSI clock range                             */
			uint32_t HSION         : 1;    /*!< MSI oscillator enable                       */
			uint32_t HSIKERON      : 1;    /*!< HSI oscillator enable                       */
			uint32_t HSIRDY        : 1;    /*!< HSI oscillator ready flag                   */
			uint32_t HSIASFS       : 1;    /*!< HSI16 automatic start from Stop                       */
			uint32_t HSIKERDY      : 1;    /*!< HSI16 kernel clock ready flag for peripherals requests */
			uint32_t Reserved_1    : 3;    /*!< Reserved bit                                */
			uint32_t HSEON         : 1;    /*!< HSE oscillator enable                       */
			uint32_t HSERDY        : 1;    /*!< HSE oscillator ready flag                   */
			uint32_t HSEBYP        : 1;    /*!< HSE oscillator bypass                       */
			uint32_t CSSON         : 1;    /*!< Clock security system enable                */
			uint32_t HSEPRE        : 1;    /*!< HSE sysclk and PLL M divider prescaler      */
			uint32_t Reserved_2    : 3;    /*!< Reserved bit                                */
			uint32_t PLLON         : 1;    /*!< Main PLL enable                             */
			uint32_t PLLRDY        : 1;    /*!< Main PLL clock ready flag                   */
			uint32_t PLLSAI1ON     : 1;    /*!< PLLSAI enable                               */
			uint32_t PLLSAI1RDY    : 1;    /*!< PLLSAI clock ready flag                     */
			uint32_t Reserved_3    : 4;    /*!< Reserved bit								*/
        } RCC_CR_register;
    };

    // RCC 鍐呴儴鏃堕挓婧愭牎鍑嗗瘎瀛樺櫒 (RCC_ICSCR)			
		// 0x5800 0004
    union {
        __IO uint32_t ICSCR;             /*!< RCC internal clock sources calibration register */
        struct ICSCR_Register {
            uint32_t HSITRIM       : 7;    /*!< HSI16 clock trimming                        */
            uint32_t HSICAL        : 8;    /*!< HSI16 clock calibration                     */
            uint32_t RESERVED3     : 1;    /*!< Reserved bit                                */
            uint32_t MSITRIM       : 8;    /*!< MSI clock trimming                          */
            uint32_t MSICAL        : 8;    /*!< MSI clock calibration                       */
        } ICSCR_register;
    };

    // RCC 鏃堕挓閰嶇疆瀵勫瓨鍣? (RCC_CFGR)						
		// 0x5800 0008
    union {
        __IO uint32_t CFGR;              /*!< RCC clock configuration register            */
        struct CFGR_Register {
            uint32_t SW            : 2;    /*!< System clock switch                         */
            uint32_t SWS           : 2;    /*!< System clock switch status                  */
            uint32_t HPRE          : 4;    /*!< AHB prescaler                               */
            uint32_t RESERVED4     : 1;    /*!< Reserved bit                                */
            uint32_t PPRE1         : 3;    /*!< APB low-speed prescaler (APB1)              */
            uint32_t PPRE2         : 3;    /*!< APB high-speed prescaler (APB2)             */
            uint32_t RTCPRE        : 5;    /*!< RTC prescaler                               */
            uint32_t MCO1          : 2;    /*!< Microcontroller clock output 1              */
            uint32_t MCO1PRE       : 3;    /*!< Microcontroller clock output 1 prescaler    */
            uint32_t MCO2PRE       : 3;    /*!< Microcontroller clock output 2 prescaler    */
            uint32_t MCO2          : 2;    /*!< Microcontroller clock output 2              */
            uint32_t RESERVED5     : 2;    /*!< Reserved bits                               */
        } CFGR_register;
    };

    // RCC PLL 閰嶇疆瀵勫瓨鍣? (RCC_PLLCFGR)				
		// 0x5800 000C
    union {
        __IO uint32_t PLLCFGR;           /*!< RCC PLL configuration register              */
        struct PLLCFGR_Register {
            uint32_t PLLM          : 6;    /*!< PLLM division factor                        */
            uint32_t PLLN          : 9;    /*!< PLLN multiplication factor                  */
            uint32_t PLLP          : 2;    /*!< PLLP division factor                        */
            uint32_t RESERVED6     : 1;    /*!< Reserved bit                                */
            uint32_t PLLSRC        : 2;    /*!< PLL entry clock source                      */
            uint32_t PLLQ          : 4;    /*!< PLLQ division factor                        */
            uint32_t RESERVED7     : 2;    /*!< Reserved bits                               */
            uint32_t PLLR          : 2;    /*!< PLLR division factor                        */
            uint32_t RESERVED8     : 3;    /*!< Reserved bits                               */
        } PLLCFGR_register;
    };

    // RCC PLLSAI1 閰嶇疆瀵勫瓨鍣? (RCC_PLLSAI1CFGR)				
		// 0x5800 0010
    union {
        __IO uint32_t PLLSAI1CFGR;       /*!< RCC PLLSAI1 configuration register          */
        struct PLLSAI1CFGR_Register {
            uint32_t PLLSAI1M      : 6;    /*!< PLLSAI1M division factor                    */
            uint32_t PLLSAI1N      : 9;    /*!< PLLSAI1N multiplication factor              */
            uint32_t PLLSAI1P      : 2;    /*!< PLLSAI1P division factor                    */
            uint32_t RESERVED9     : 1;    /*!< Reserved bit                                */
            uint32_t PLLSAI1SRC    : 2;    /*!< PLLSAI1 entry clock source                  */
            uint32_t PLLSAI1Q      : 4;    /*!< PLLSAI1Q division factor                    */
            uint32_t RESERVED10    : 2;    /*!< Reserved bits                               */
            uint32_t PLLSAI1R      : 2;    /*!< PLLSAI1R division factor                    */
            uint32_t RESERVED11    : 3;    /*!< Reserved bits                               */
        } PLLSAI1CFGR_register;
    };
		
