TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    uint32_t RESERVED_0;
    // RCC 鏃堕挓涓柇浣胯兘瀵勫瓨鍣? (RCC_CIER)						
		// 0x5800 0018
    union {
        __IO uint32_t CIER;              /*!< RCC clock interrupt enable register         */
        struct CIER_Register {
            uint32_t LSIRDYIE      : 1;    /*!< LSIRDY interrupt enable                     */
            uint32_t LSERDYIE      : 1;    /*!< LSERDY interrupt enable                     */
            uint32_t HSIRDYIE      : 1;    /*!< HSIRDY interrupt enable                     */
            uint32_t HSERDYIE      : 1;    /*!< HSERDY interrupt enable                     */
            uint32_t PLLRDYIE      : 1;    /*!< PLLRDY interrupt enable                     */
            uint32_t PLLSAI1RDYIE  : 1;    /*!< PLLSAI1RDY interrupt enable                 */
            uint32_t HSI48RDYIE    : 1;    /*!< HSI48RDY interrupt enable                   */
            uint32_t MSIRDYIE      : 1;    /*!< MSIRDY interrupt enable                     */
            uint32_t LSECSSIE      : 1;    /*!< LSECSS interrupt enable                     */
            uint32_t CSSCIE        : 1;    /*!< CSSC interrupt enable                       */
            uint32_t RESERVED12    : 22;   /*!< Reserved bits                               */
        } CIER_register;
    };

    // RCC 鏃堕挓涓柇鏍囧織瀵勫瓨鍣? (RCC_CIFR)			
		// 0x5800 001C
    union {
        __IO uint32_t CIFR;              /*!< RCC clock interrupt flag register           */
        struct CIFR_Register {
            uint32_t LSIRDYF       : 1;    /*!< LSIRDY flag                                 */
            uint32_t LSERDYF       : 1;    /*!< LSERDY flag                                 */
            uint32_t HSIRDYF       : 1;    /*!< HSIRDY flag                                 */
            uint32_t HSERDYF       : 1;    /*!< HSERDY flag                                 */
            uint32_t PLLRDYF       : 1;    /*!< PLLRDY flag                                 */
            uint32_t PLLSAI1RDYF   : 1;    /*!< PLLSAI1RDY flag                             */
            uint32_t HSI48RDYF     : 1;    /*!< HSI48RDY flag                               */
            uint32_t MSIRDYF       : 1;    /*!< MSIRDY flag                                 */
            uint32_t LSECSSF       : 1;    /*!< LSECSS flag                                 */
            uint32_t CSSCF         : 1;    /*!< CSSC flag                                   */
            uint32_t RESERVED13    : 22;   /*!< Reserved bits                               */
        } CIFR_register;
    };

    // RCC 鏃堕挓涓柇娓呴浂瀵勫瓨鍣? (RCC_CICR)			
		// 0x5800 0020
    union {
        __IO uint32_t CICR;              /*!< RCC clock interrupt clear register          */
        struct CICR_Register {
            uint32_t LSIRDYCF      : 1;    /*!< LSIRDY clear flag                           */
            uint32_t LSERDYCF      : 1;    /*!< LSERDY clear flag                           */
            uint32_t HSIRDYCF      : 1;    /*!< HSIRDY clear flag                           */
            uint32_t HSERDYCF      : 1;    /*!< HSERDY clear flag                           */
            uint32_t PLLRDYCF      : 1;    /*!< PLLRDY clear flag                           */
            uint32_t PLLSAI1RDYCF  : 1;    /*!< PLLSAI1RDY clear flag                       */
            uint32_t HSI48RDYCF    : 1;    /*!< HSI48RDY clear flag                         */
            uint32_t MSIRDYCF      : 1;    /*!< MSIRDY clear flag                           */
            uint32_t LSECSSCF      : 1;    /*!< LSECSS clear flag                           */
            uint32_t CSSCCF        : 1;    /*!< CSSC clear flag                             */
            uint32_t RESERVED14    : 22;   /*!< Reserved bits                               */
        } CICR_register;
    };

    // RCC SMPS 闄嶅帇杞崲鍣ㄦ帶鍒跺瘎瀛樺櫒 (RCC_SMPSCR)			
		// 0x5800 0024
    union {
        __IO uint32_t SMPSCR;            /*!< RCC SMPS step-down converter control register */
        struct SMPSCR_Register {
            uint32_t SMPSSEL       : 2;    /*!< SMPS clock selection                        */
            uint32_t SMPSDIV       : 2;    /*!< SMPS clock prescaler                        */
            uint32_t RESERVED15    : 4;    /*!< Reserved bits                               */
            uint32_t SMPSEN        : 1;    /*!< SMPS enable                                 */
            uint32_t SMPSRUNSTDBY  : 1;    /*!< SMPS run in standby                         */
            uint32_t SMPSLEVEL     : 3;    /*!< SMPS voltage level                          */
            uint32_t RESERVED16    : 19;   /*!< Reserved bits                               */
        } SMPSCR_register;
    };

    // RCC AHB1 澶栬澶嶄綅瀵勫瓨鍣? (RCC_AHB1RSTR)			
		// 0x5800 0028
    union {
        __IO uint32_t AHB1RSTR;          /*!< RCC AHB1 peripheral reset register          */
        struct AHB1RSTR_Register {
            uint32_t DMA1RST       : 1;    /*!< DMA1 reset                                  */
            uint32_t DMA2RST       : 1;    /*!< DMA2 reset                                  */
            uint32_t DMAMUX1RST    : 1;    /*!< DMAMUX reset                                  */
            uint32_t Reserved_0    : 9;
						uint32_t CRCRST        : 1;    /*!< CRC reset                                 */
            uint32_t Reserved_1    : 3;    
            uint32_t TSCRST			   : 1;    /*!< Touch Sensing Controller reset           */
            uint32_t Reserved_2    : 15;   /*!< Reserved bits                               */
        } AHB1RSTR_register;
    };

    // RCC AHB2 澶栬澶嶄綅瀵勫瓨鍣? (RCC_AHB2RSTR)			
		// 0x5800 002C
    union {
        __IO uint32_t AHB2RSTR;          /*!< RCC AHB2 peripheral reset register          */
        struct AHB2RSTR_Register {
            uint32_t GPIOARST      : 1;    /*!< GPIOA reset                                 */
            uint32_t GPIOBRST      : 1;    /*!< GPIOB reset                                 */
            uint32_t GPIOCRST      : 1;    /*!< GPIOC reset                                 */
            uint32_t GPIODRST      : 1;    /*!< GPIOD reset                                 */
            uint32_t GPIOERST      : 1;    /*!< GPIOE reset                                 */
            uint32_t Reserved_0    : 2;    /*!< Reserved bit                                */
            uint32_t GPIOHRST      : 1;    /*!< GPIOH reset                                 */
            uint32_t Reserved_1    : 5;    /*!< ADC1 and ADC2 reset                         */
            uint32_t ADCRST        : 1;    /*!< ADC3 reset                                  */
            uint32_t Reserved_3    : 18;   /*!< Reserved bits                               */
        } AHB2RSTR_register;
    };

    // RCC AHB3 鍜? AHB4 澶栬澶嶄綅瀵勫瓨鍣? (RCC_AHB3RSTR)			
		// 0x5800 0030
    union {
        __IO uint32_t AHB3RSTR;          /*!< RCC AHB3 and AHB4 peripheral reset register */
        struct AHB3RSTR_Register {
            uint32_t Reserved_0    : 8;   /*!< Reserved bits                               */
            uint32_t QUADSPIRST    : 1;    /*!< QUADSPI reset                               */
            uint32_t Reserved_1    : 7;   /*!< Reserved bits                               */
            uint32_t PKARST        : 1;    /*!< PKA reset                                   */
            uint32_t AES2RST       : 1;    /*!< AES2 reset                                  */
            uint32_t RNGRST        : 1;    /*!< RNG reset                                   */
            uint32_t HSEMRST       : 1;    /*!< HSEM reset                                  */
            uint32_t IPCCRST       : 1;    /*!< IPCC interface reset                        */
            uint32_t Reserved_2    : 4;   /*!< Reserved bits                               */
            uint32_t FLASHRST      : 1;    /*!< Flash interface reset                       */
            uint32_t Reserved_3    : 6;    /*!< Reserved bits                               */

			
