TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
        } AHB3RSTR_register;
    };

    uint32_t RESERVED_1;
    // RCC APB1 澶栬澶嶄綅瀵勫瓨鍣? 1 (RCC_APB1RSTR1)			
		// 0x5800 0038
    union {
        __IO uint32_t APB1RSTR1;         /*!< RCC APB1 peripheral reset register 1        */
        struct APB1RSTR1_Register {
            uint32_t TIM2RST       : 1;    /*!< TIM2 reset                                  */
            uint32_t Reserved_0    : 8;   /*!< Reserved bits                               */
            uint32_t LCDRST        : 1;    /*!< LCD reset                                   */
            uint32_t Reserved_1    : 4;   /*!< Reserved bits                               */
            uint32_t SPI2RST       : 1;    /*!< SPI2 reset                                  */
            uint32_t Reserved_2    : 6;   /*!< Reserved bits                               */
            uint32_t I2C1RST       : 1;    /*!< I2C1 reset                                  */
            uint32_t Reserved_3    : 1;   /*!< Reserved bits                               */
            uint32_t I2C3RST       : 1;    /*!< I2C3 reset                                  */
            uint32_t CRSRST        : 1;    /*!< CRS reset                                   */
            uint32_t Reserved_4    : 1;   /*!< Reserved bits                               */
            uint32_t USBFSRST      : 1;    /*!< USBFS reset                                 */
            uint32_t Reserved_5    : 4;   /*!< Reserved bits                               */
            uint32_t LPTIM1RST     : 1;    /*!< LPTIM1 reset                                */
        } APB1RSTR1_register;
    };

    // RCC APB1 澶栬澶嶄綅瀵勫瓨鍣? 2 (RCC_APB1RSTR2)			
		// 0x5800 003C
    union {
        __IO uint32_t APB1RSTR2;         /*!< RCC APB1 peripheral reset register 2        */
        struct APB1RSTR2_Register {
            uint32_t LPUART1RST    : 1;    /*!< LPUART1 reset                               */
            uint32_t Reserved_0    : 4;    /*!< Reserved bits                               */
            uint32_t LPTIM2RST     : 1;    /*!< LPTIM2 reset                                */
            uint32_t Reserved_1    : 26;   /*!< Reserved bits                               */
        } APB1RSTR2_register;
    };

    // RCC APB2 澶栬澶嶄綅瀵勫瓨鍣? (RCC_APB2RSTR)			
		// 0x5800 0040
    union {
        __IO uint32_t APB2RSTR;          /*!< RCC APB2 peripheral reset register          */
        struct APB2RSTR_Register {
            uint32_t Reserved_0    : 11;    /*!< Reserved bits                               */
            uint32_t TIM1RST       : 1;    /*!< TIM1 reset                                  */
            uint32_t SPI1RST       : 1;    /*!< SPI1 reset                                  */
            uint32_t Reserved_1    : 1;    /*!< Reserved bits                               */
            uint32_t USART1RST     : 1;    /*!< USART1 reset                                */
            uint32_t Reserved_2    : 2;    /*!< Reserved bits                               */
            uint32_t TIM16RST      : 1;    /*!< TIM16 reset                                 */
            uint32_t TIM17RST      : 1;    /*!< TIM17 reset                                 */
            uint32_t Reserved_3    : 2;    /*!< Reserved bits                               */
            uint32_t SAI1RST       : 1;    /*!< SAI1 reset                                  */
            uint32_t RESERVED31    : 10;   /*!< Reserved bits                               */
        } APB2RSTR_register;
    };

    // RCC APB3 澶栬澶嶄綅瀵勫瓨鍣? (RCC_APB3RSTR)			
		// 0x5800 0044
    union {
        __IO uint32_t APB3RSTR;          /*!< RCC APB3 peripheral reset register          */
        struct APB3RSTR_Register {
            uint32_t RFRST         : 1;    /*!< Radio system reset                          */
            uint32_t Reserved_0    : 31;   /*!< Reserved bits                               */
        } APB3RSTR_register;
    };

    // RCC AHB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB1ENR)			
		// 0x5800 0048
    union {
        __IO uint32_t AHB1ENR;           /*!< RCC AHB1 peripheral clock enable register   */
        struct AHB1ENR_Register {
            uint32_t DMA1EN        : 1;    /*!< DMA1 clock enable                           */
            uint32_t DMA2EN        : 1;    /*!< DMA2 clock enable                           */
            uint32_t DMAMUX1EN     : 1;    /*!< DMAMUX clock enable                          */
            uint32_t Reserved_0    : 9;   /*!< Reserved bits                               */
            uint32_t CRCEN         : 1;    /*!< CRC clock enable                            */
            uint32_t Reserved_1    : 3;   /*!< Reserved bits                               */
            uint32_t TSCEN         : 1;    /*!< TSC clock enable                            */
            uint32_t Reserved_2    : 15;   /*!< Reserved bits                               */
        } AHB1ENR_register;
    };

    // RCC AHB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB2ENR)			
		// 0x5800 004C
    union {
        __IO uint32_t AHB2ENR;           /*!< RCC AHB2 peripheral clock enable register   */
        struct AHB2ENR_Register {
            uint32_t GPIOAEN       : 1;    /*!< GPIOA clock enable                          */
            uint32_t GPIOBEN       : 1;    /*!< GPIOB clock enable                          */
            uint32_t GPIOCEN       : 1;    /*!< GPIOC clock enable                          */
            uint32_t GPIODEN       : 1;    /*!< GPIOD clock enable                          */
            uint32_t GPIOEEN       : 1;    /*!< GPIOE clock enable                          */
            uint32_t Reserved_0    : 2;   /*!< Reserved bits                               */
            uint32_t GPIOHEN       : 1;    /*!< GPIOH clock enable                          */
            uint32_t Reserved_1    : 5;   /*!< Reserved bits                               */
            uint32_t ADCEN		   : 1;    /*!< ADC clock enable                  */
            uint32_t Reserved_2    : 2;    /*!< Reserved bits                               */
            uint32_t AES1EN        : 1;    /*!< AES1 clock enable                           */
            uint32_t Reserved_3    : 15;   /*!< Reserved bits                               */
        } AHB2ENR_register;
    };

