TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    // RCC AHB3 鍜? AHB4 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB3ENR)			
		// 0x5800 0050
    union {
        __IO uint32_t AHB3ENR;           /*!< RCC AHB3 and AHB4 peripheral clock enable register */
        struct AHB3ENR_Register {
            uint32_t Reserved_0    : 8;   /*!< Reserved bits                               */
            uint32_t QUADSPIEN     : 1;    /*!< QUADSPI clock enable                        */
            uint32_t Reserved_1    : 7;   /*!< Reserved bits                               */
            uint32_t PKAEN         : 1;    /*!< PKA clock enable                            */
            uint32_t AES2EN        : 1;    /*!< AES2 clock enable                           */
            uint32_t RNGEN         : 1;    /*!< RNG clock enable                            */
            uint32_t HSEMEN        : 1;    /*!< HSEM clock enable                           */
            uint32_t IPCCEN        : 1;    /*!< IPCC interface clock enable                 */
            uint32_t Reserved_2    : 4;   /*!< Reserved bits                               */
            uint32_t FLASHEN       : 1;    /*!< Flash interface clock enable                */
            uint32_t Reserved_3    : 6;   /*!< Reserved bits                               */
        } AHB3ENR_register;
    };

    uint32_t RESERVED_2;
    // RCC APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 1 (RCC_APB1ENR1)			
		// 0x5800 0058
    union {
        __IO uint32_t APB1ENR1;          /*!< RCC APB1 peripheral clock enable register 1 */
        struct APB1ENR1_Register {
            uint32_t TIM2EN        : 1;    /*!< TIM2 clock enable                           */
            uint32_t Reserved_0    : 8;   /*!< Reserved bits                               */
            uint32_t LCDEN         : 1;    /*!< LCD clock enable                            */
            uint32_t RTCAPBEN      : 1;    /*!< RTC APB clock enable                        */
            uint32_t WWDGEN        : 1;    /*!< CPU1 Window watchdog clock enable          */
            uint32_t Reserved_1    : 2;   /*!< Reserved bits                               */
            uint32_t SPI2EN        : 1;    /*!< SPI2 clock enable                           */
            uint32_t Reserved_2    : 6;   /*!< Reserved bits                               */
            uint32_t I2C1EN        : 1;    /*!< I2C1 clock enable                           */
            uint32_t Reserved_3    : 1;   /*!< Reserved bits                               */
            uint32_t I2C3EN        : 1;    /*!< I2C3 clock enable                           */
            uint32_t CRSEN         : 1;    /*!< CRS clock enable                            */
            uint32_t Reserved_4    : 1;   /*!< Reserved bits                               */
            uint32_t USBFSEN       : 1;    /*!< USBFS clock enable                          */
            uint32_t Reserved_5    : 4;   /*!< Reserved bits                               */
            uint32_t LPTIM1EN      : 1;    /*!< LPTIM1 clock enable                         */
        } APB1ENR1_register;
    };

    // RCC APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 2 (RCC_APB1ENR2)			
		// 0x5800 005C
    union {
        __IO uint32_t APB1ENR2;          /*!< RCC APB1 peripheral clock enable register 2 */
        struct APB1ENR2_Register {
            uint32_t LPUART1EN     : 1;    /*!< LPUART1 clock enable                        */
            uint32_t Reserved_0    : 4;    /*!< Reserved bits                               */
            uint32_t LPTIM2EN      : 1;    /*!< LPTIM2 clock enable                         */
            uint32_t Reserved_1    : 26;   /*!< Reserved bits                               */
        } APB1ENR2_register;
    };

    // RCC APB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_APB2ENR)			
		// 0x5800 0060
    union {
        __IO uint32_t APB2ENR;           /*!< RCC APB2 peripheral clock enable register   */
        struct APB2ENR_Register {
            uint32_t Reserved_0    : 11;    /*!< Reserved bits                               */
            uint32_t TIM1EN        : 1;    /*!< TIM1 clock enable                           */
            uint32_t SPI1EN        : 1;    /*!< SPI1 clock enable                           */
            uint32_t Reserved_1    : 1;    /*!< Reserved bits                               */
            uint32_t USART1EN      : 1;    /*!< USART1 clock enable                         */
            uint32_t Reserved_2    : 2;    /*!< Reserved bits                               */
            uint32_t TIM16EN       : 1;    /*!< TIM16 clock enable                          */
            uint32_t TIM17EN       : 1;    /*!< TIM17 clock enable                          */
            uint32_t Reserved_3    : 2;    /*!< Reserved bits                               */
            uint32_t SAI1EN        : 1;    /*!< SAI1 clock enable                           */
            uint32_t Reserved_4    : 10;   /*!< Reserved bits                               */
        } APB2ENR_register;
    };

    uint32_t RESERVED_3;
    // 鐫＄湢妯″紡涓嬬殑 RCC AHB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB1SMENR)			
		// 0x5800 0068
    union {
        __IO uint32_t AHB1SMENR;         /*!< RCC AHB1 peripheral clocks enable in Sleep modes register */
        struct AHB1SMENR_Register {
            uint32_t DMA1SMEN     : 1;    /*!< DMA1 clock enable in Sleep mode              */
            uint32_t DMA2SMEN     : 1;    /*!< DMA2 clock enable in Sleep mode              */
            uint32_t DMAMUX1SMEN  : 1;    /*!< DMAMUX1 clock enable in Sleep mode             */
            uint32_t Reserved_0   : 6;    /*!< Reserved bits                               */
            uint32_t SRAM1SMEN    : 1;    /*!< SRAM1 clock enable in Sleep mode             */
            uint32_t Reserved_1   : 2;    /*!< Reserved bits                               */
            uint32_t CRCSMEN      : 1;    /*!< CRC clock enable in Sleep mode               */
            uint32_t Reserved_3   : 3;    /*!< Reserved bits                               */
            uint32_t TSCSMEN      : 1;    /*!< TSC clock enable in Sleep mode               */
            uint32_t Reserved_4   : 15;   /*!< Reserved bits                                */
        } AHB1SMENR_register;
    };

    // 鐫＄湢妯″紡涓嬬殑 RCC AHB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB2SMENR)
		// 0x5800 006C
    union {
        __IO uint32_t AHB2SMENR;         /*!< RCC AHB2 peripheral clocks enable in Sleep modes register */
        struct AHB2SMENR_Register {
            uint32_t GPIOASMEN    : 1;    /*!< GPIOA clock enable in Sleep mode             */
            uint32_t GPIOBSMEN    : 1;    /*!< GPIOB clock enable in Sleep mode             */
            uint32_t GPIOCSMEN    : 1;    /*!< GPIOC clock enable in Sleep mode             */
            uint32_t GPIODSMEN    : 1;    /*!< GPIOD clock enable in Sleep mode             */
            uint32_t GPIOESMEN    : 1;    /*!< GPIOE clock enable in Sleep mode             */
            uint32_t Reserved_0   : 2;    /*!< Reserved bits                               */
            uint32_t GPIOHSMEN    : 1;    /*!< GPIOH clock enable in Sleep mode             */
            uint32_t Reserved_1   : 5;    /*!< Reserved bits                               */
            uint32_t ADCSMEN      : 1;    /*!< ADC3 clock enable in Sleep mode              */
            uint32_t Reserved_2   : 2;    /*!< Reserved bits                               */
            uint32_t AES1SMEN     : 1;    /*!< AES1 clock enable in Sleep mode              */
            uint32_t Reserved_3   : 15;   /*!< Reserved bits                                */
        } AHB2SMENR_register;
    };

    // 鐫＄湢鍜屽仠姝㈡ā寮忎笅鐨? RCC AHB3 鍜? AHB4 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_AHB3SMENR)
		//		0x5800 0070
    union {
        __IO uint32_t AHB3SMENR;         /*!< RCC AHB3 and AHB4 peripheral clocks enable in Sleep and Stop modes register */
        struct AHB3SMENR_Register {
            uint32_t Reserved_0   : 8;    /*!< Reserved bits                               */
            uint32_t QUADSPISMEN  : 1;    /*!< QUADSPI clock enable in Sleep mode           */
            uint32_t Reserved_1   : 7;    /*!< Reserved bits                               */
            uint32_t PKASMEN      : 1;    /*!< PKA clock enable in Sleep mode               */
            uint32_t AES2SMEN     : 1;    /*!< AES2 clock enable in Sleep mode              */
            uint32_t RNGSMEN      : 1;    /*!< RNG clock enable in Sleep mode               */
            uint32_t Reserved_2   : 5;    /*!< Reserved bits                               */
            uint32_t SRAM2SMEN    : 1;    /*!< SRAM2a and SRAM2b memory interface clock enable during CPU1 CSleep mode  */
            uint32_t FLASHSMEN    : 1;    /*!< Flash interface clock enable in Sleep mode   */
            uint32_t Reserved_3   : 6;   /*!< Reserved bits                                */
        } AHB3SMENR_register;
    };

