TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    uint32_t RESERVED_4;
    // 鐫＄湢妯″紡涓嬬殑 RCC APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 1 (RCC_APB1SMENR1)
		//		0x5800 0078
	union {
		__IO uint32_t APB1SMENR1;		  /*!< RCC APB1 peripheral clocks enable in Sleep mode register 1 */
		struct APB1SMENR1_Register {
			uint32_t TIM2SMEN	  : 1;	  /*!< 浣?0: TIM2 clock enable in Sleep/Stop mode				*/
			uint32_t Reserved_0   : 8;	  /*!< 浣?1~8: 淇濈暀浣?										   */
			uint32_t LSESMEN	  : 1;	  /*!< 浣?9: LSE clock enable in Sleep mode (娉細鍥剧墖涓綅9鏄疞SESMEN) */
			uint32_t RTCAPBSMEN   : 1;	  /*!< 浣?10: RTC APB clock enable in Sleep mode				*/
			uint32_t WWDGSMEN	  : 1;	  /*!< 浣?11: WWDG clock enable in Sleep/Stop mode				*/
			uint32_t Reserved_1   : 2;	  /*!< 淇濈暀浣? 								   */
			uint32_t SPI2SMEN	  : 1;	  /*!< 浣?14: SPI2 clock enable in Sleep/Stop mode				*/
			uint32_t Reserved_2   : 6;   /*!< 淇濈暀浣?										  */
			uint32_t I2C1SMEN	  : 1;	  /*!< 浣?28: I2C1 clock enable in Sleep/Stop mode				*/
			uint32_t Reserved_3   : 1;   /*!< 淇濈暀浣?										  */
			uint32_t I2C3SMEN	  : 1;	  /*!< 浣?29: I2C3 clock enable in Sleep/Stop mode				*/
			uint32_t CRSSMEN	  : 1;	  /*!< 浣?30: CRS clock enable in Sleep mode					*/
			uint32_t Reserved_4   : 1;   /*!< 淇濈暀浣?										  */
			uint32_t USBSMEN	  : 1;	  /*!< 浣?26: USB FS clock enable in Sleep/Stop mode			*/
			uint32_t Reserved_5   : 4;   /*!< 淇濈暀浣?										  */
			uint32_t LPTIM1SMEN   : 1;	  /*!< 浣?31: LPTIM1 clock enable in Sleep/Stop mode			*/
		} APB1SMENR1_register;
	};


    // 鐫＄湢妯″紡涓嬬殑 RCC APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 2 (RCC_APB1SMENR2)
		//		0x5800 007C
		union {
        __IO uint32_t APB1SMENR2;        /*!< RCC APB1 peripheral clocks enable in Sleep mode register 2 */
        struct APB1SMENR2_Register {
            uint32_t LPUART1SMEN   : 1;    /*!< LPUART1 clock enable in Sleep mode           */
            uint32_t Reserved_0    : 4;    /*!< Reserved bits                                */
            uint32_t LPTIM2SMEN    : 1;    /*!< LPTIM2 clock enable in Sleep mode            */
            uint32_t Reserved_1    : 26;   /*!< Reserved bits                                */
        } APB1SMENR2_register;
    };

    // 鐫＄湢妯″紡涓嬬殑 RCC APB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_APB2SMENR)
		//		0x5800 0080
		union {
		__IO uint32_t APB2SMENR;		  /*!< RCC APB2 peripheral clocks enable in Sleep mode register */
		struct APB2SMENR_Register {
			uint32_t Reserved_0   : 11;   /*!< 浣?0~15: 淇濈暀浣嶏紙鍏朵腑浣?10銆?12銆?13銆?14涓烘湁鏁堜綅锛屽叾浣欎负淇濈暀锛? */
			uint32_t TIM1SMEN	  : 1;	  /*!< 浣?10: TIM1 clock enable in Sleep/Stop mode */
			uint32_t SPI1SMEN	  : 1;	  /*!< 浣?12: SPI1 clock enable in Sleep/Stop mode */
			uint32_t Reserved_1   : 1;	  /*!< 浣?17銆?19~20: 淇濈暀浣? */
			uint32_t USART1SMEN   : 1;	  /*!< 浣?14: USART1 clock enable in Sleep/Stop mode */
			uint32_t Reserved_2   : 2;   /*!< 浣?22~31: 淇濈暀浣? */
			uint32_t TIM16SMEN	  : 1;	  /*!< 浣?16: TIM16 clock enable in Sleep/Stop mode */
			uint32_t TIM17SMEN	  : 1;	  /*!< 浣?18: TIM17 clock enable in Sleep/Stop mode */
			uint32_t Reserved_3   : 2;   /*!< 浣?22~31: 淇濈暀浣? */
			uint32_t SAI1SMEN	  : 1;	  /*!< 浣?21: SAI1 clock enable in Sleep/Stop mode */
			uint32_t Reserved_4   : 10;   /*!< 浣?22~31: 淇濈暀浣? */
		} APB2SMENR_register;
	};


    uint32_t RESERVED_5;
    // RCC 澶栬鐙珛鏃堕挓閰嶇疆瀵勫瓨鍣? (RCC_CCIPR)
		//		0x5800 0088
		union {
		__IO uint32_t CCIPR;			  /*!< RCC peripherals independent clock configuration register */
		struct CCIPR_Register {
			uint32_t USART1SEL		: 2;  /*!< 浣?0~1: USART1 clock source selection */
			uint32_t Reserved_0 	: 8; /*!< 浣?2~11: 淇濈暀浣? */
			uint32_t LPUART1SEL 	: 2;  /*!< 浣?12~13: LPUART1 clock source selection */
			uint32_t I2C2SEL		: 2;  /*!< 浣?14~15: I2C2 clock source selection */
			uint32_t Reserved_1 	: 2;  /*!< 浣?24~25: 淇濈暀浣? */
			uint32_t I2C3SEL		: 2;  /*!< 浣?16~17: I2C3 clock source selection */
			uint32_t LPTIM1SEL		: 2;  /*!< 浣?18~19: LPTIM1 clock source selection */
			uint32_t LPTIM2SEL		: 2;  /*!< 浣?20~21: LPTIM2 clock source selection */
			uint32_t SAI1SEL		: 2;  /*!< 浣?22~23: SAI1 clock source selection */
			uint32_t Reserved_2 	: 2;  /*!< 浣?24~25: 淇濈暀浣? */
			uint32_t CLK48SEL		: 2;  /*!< 浣?26~27: 48 MHz clock source selection */
			uint32_t ADCSEL 		: 2;  /*!< 浣?28~29: ADC clock source selection */
			uint32_t RNGSEL 		: 2;  /*!< 浣?30~31: RNG clock source selection */
		} CCIPR_register;
	};


    uint32_t RESERVED_6;
    // RCC 澶囦唤鍩熸帶鍒跺瘎瀛樺櫒 (RCC_BDCR)
		//		0x5800 0090
    union {
        __IO uint32_t BDCR;              /*!< RCC backup domain control register           */
        struct BDCR_Register {
            uint32_t LSEON        : 1;    /*!< LSE oscillator enable                        */
            uint32_t LSERDY       : 1;    /*!< LSE oscillator ready flag                    */
            uint32_t LSEBYP       : 1;    /*!< LSE oscillator bypass                        */
            uint32_t LSEDRV       : 2;		// LSE 鎸崱鍣ㄩ┍鍔ㄨ兘鍔?
            uint32_t LSECSSON     : 1;    /*!< LSE CSS enable                               */
            uint32_t LSECSSD      : 1;    // LSE 涓婄殑 CSS 鏁呴殰妫?娴?
            uint32_t Reserved_0   : 1;    /*!< Reserved bit                                 */
            uint32_t RTCSEL       : 2;    /*!< RTC clock source selection                   */
            uint32_t Reserved_1   : 5;    /*!< Reserved bits                                */
            uint32_t RTCEN        : 1;    /*!< RTC clock enable                             */
            uint32_t BDRST        : 1;    /*!< Backup domain software reset                 */
            uint32_t Reserved_2   : 7;   /*!< Reserved bits                                */
            uint32_t LSCOEN       : 1;    /*!< Low speed clock output enable                */
            uint32_t LSCOSEL      : 1;    /*!< Low speed clock output selection             */
            uint32_t Reserved_3   : 6;   /*!< Reserved bits                                */
        } BDCR_register;
    };

    // RCC 鎺у埗/鐘舵?佸瘎瀛樺櫒 (RCC_CSR)
		//		0x5800 0094
	union {
		__IO uint32_t CSR;				  /*!< RCC control/status register					 */
		struct CSR_Register {
			uint32_t LSI1ON 	   : 1;    /*!< 浣?0: LSI1 oscillator enable					*/
			uint32_t LSI1RDY	   : 1;    /*!< 浣?1: LSI1 oscillator ready flag				*/
			uint32_t LSI2ON 	   : 1;    /*!< 浣?2: LSI2 oscillator enable					*/
			uint32_t LSI2RDY	   : 1;    /*!< 浣?3: LSI2 oscillator ready flag				*/
			uint32_t Reserved_0    : 4;    /*!< 浣?4~7: Reserved bits							*/
			uint32_t LSI2TRIM	   : 4;    /*!< 浣?8~11: LSI2 oscillator trimming				*/
			uint32_t Reserved_1    : 2;    /*!< 浣?12~13: Reserved bits 						*/
			uint32_t RFWKPSEL	   : 2;    /*!< 浣?14~15: RF wakeup clock source selection		*/
			uint32_t RFRSTSF	   : 1;    /*!< 浣?16: RF reset status flag (read-only) 		*/
			uint32_t Reserved_2    : 6;    /*!< 浣?17~23: Reserved bits 						*/
			uint32_t RMVF		   : 1;    /*!< 浣?24: Reset flags clear						*/
			uint32_t Reserved_3    : 1;    /*!< 浣?25: Reserved bit 							*/
			uint32_t OBLRSTF	   : 1;    /*!< 浣?26: Option byte load reset flag (read-only)	*/
			uint32_t PINRSTF	   : 1;    /*!< 浣?27: Pin reset flag (read-only)				*/
			uint32_t BORRSTF	   : 1;    /*!< 浣?28: Brownout reset flag (read-only)			*/
			uint32_t SFTRSTF	   : 1;    /*!< 浣?29: Software reset flag (read-only)			*/
			uint32_t IWWGRSTF	   : 1;    /*!< 浣?30: Independent watchdog reset flag (read-only) */
			uint32_t WWDGRSTF	   : 1;    /*!< 浣?31: Window watchdog reset flag (read-only)	*/
			uint32_t LPWRRSTF	   : 1;    /*!< 浣?31: Low-power reset flag (read-only) 		*/
		} CSR_register;
	};


    // RCC 鏃堕挓鎭㈠ RC 瀵勫瓨鍣? (RCC_CRRCR)
		//		0x5800 0098
    union {
        __IO uint32_t CRRCR;             /*!< RCC Clock recovery RC register              */
        struct CRRCR_Register {
            uint32_t HSI48ON     : 1;    /*!< HSI48 clock enable                          */
            uint32_t HSI48RDY    : 1;    /*!< HSI48 clock ready flag                      */
            uint32_t Reserved_0  : 5;    /*!< Reserved bits                               */
            uint32_t HSI48CAL    : 9;    /*!< HSI48 clock calibration                     */
            uint32_t Reserved_1  : 16;   /*!< Reserved bits                               */
        } CRRCR_register;
    };

