TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    // RCC 鏃堕挓 HSE 瀵勫瓨鍣? (RCC_HSECR)
		//		0x5800 009C
	union {
		__IO uint32_t HSECR;			  /*!< RCC clock HSE register */
		struct HSECR_Register {
			uint32_t UNLOCKED	  : 1;	  /*!< 浣?0: Unlocked status */
			uint32_t Reserved_0   : 2;	  /*!< 浣?1~2: Reserved bits */
			uint32_t HSES		  : 1;	  /*!< 浣?3: HSE enable status */
			uint32_t HSEGMC 	  : 3;	  /*!< 浣?4~6: HSE gain margin control */
			uint32_t Reserved_1   : 1;	  /*!< 浣?7: Reserved bit */
			uint32_t HSETUNE	  : 6;	  /*!< 浣?8~13: HSE tuning */
			uint32_t Reserved_2   : 2;	  /*!< 浣?14~15: Reserved bits */
			uint32_t Reserved_3   : 16;   /*!< 浣?16~31: Reserved bits */
		} HSECR_register;
	};


    uint32_t RESERVED_7[26];
    // RCC 鎵╁睍鏃堕挓鎭㈠瀵勫瓨鍣? (RCC_EXTCFGR)
		//		0x5800 0108
	union {
		__IO uint32_t EXTCCFGR; 		  /*!< RCC extended clock recovery register */
		struct EXTCCFGR_Register {
			uint32_t SHDHPRE	  : 4;	  /*!< SHDH prescaler */
			uint32_t C2HPRE 	  : 4;	  /*!< C2H prescaler */
			uint32_t Reserved_0   : 8;	  /*!< Reserved bits */
			uint32_t SHDHPREF	  : 1;	  /*!< SHDH prescaler flag */
			uint32_t C2HPREF	  : 1;	  /*!< C2H prescaler flag */
			uint32_t Reserved_1   : 2;	  /*!< Reserved bits */
			uint32_t RFCSS		  : 1;	  /*!< RFCSS flag */
			uint32_t Reserved_2   : 11;   /*!< Reserved bits */
		} EXTCCFGR_register;
	};


    uint32_t RESERVED_8[15];
    // RCC CPU2 AHB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB1ENR)
		//		0x5800 0148
	union {
		__IO uint32_t C2AHB1ENR;		  /*!< RCC CPU2 AHB1 peripheral clock enable register */
		struct C2AHB1ENR_Register {
			uint32_t DMA1EN 	  : 1;	  /*!< DMA1 clock enable */
			uint32_t DMA2EN 	  : 1;	  /*!< DMA2 clock enable */
			uint32_t DMAMUX1EN	  : 1;	  /*!< DMAMUX1 clock enable */
			uint32_t Reserved_0   : 6;	  /*!< Reserved bits */
			uint32_t SRAM1EN	  : 1;	  /*!< SRAM1 clock enable */
			uint32_t Reserved_1   : 2;	  /*!< Reserved bits */
			uint32_t CRCEN		  : 1;	  /*!< CRC clock enable */
			uint32_t Reserved_2   : 3;	  /*!< Reserved bits */
			uint32_t TSCEN		  : 1;	  /*!< TSC clock enable */
			uint32_t Reserved_3   : 15;   /*!< Reserved bits */
		} C2AHB1ENR_register;
	};


    // RCC CPU2 AHB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB2ENR)
		//		0x5800 014C
	union {
		__IO uint32_t C2AHB2ENR;		  /*!< RCC CPU2 AHB2 peripheral clock enable register */
		struct C2AHB2ENR_Register {
			uint32_t GPIOAEN	  : 1;	  /*!< GPIOA clock enable */
			uint32_t GPIOBEN	  : 1;	  /*!< GPIOB clock enable */
			uint32_t GPIOCEN	  : 1;	  /*!< GPIOC clock enable */
			uint32_t GPIODEN	  : 1;	  /*!< GPIOD clock enable */
			uint32_t GPIOEEN	  : 1;	  /*!< GPIOE clock enable */
			uint32_t Reserved_0   : 2;	  /*!< Reserved bits */
			uint32_t GPIOHEN	  : 1;	  /*!< GPIOH clock enable */
			uint32_t Reserved_1   : 5;	  /*!< Reserved bits */
			uint32_t ADCEN		  : 1;	  /*!< ADC clock enable */
			uint32_t Reserved_2   : 2;	  /*!< Reserved bits */
			uint32_t AES1EN 	  : 1;	  /*!< AES1 clock enable */
			uint32_t Reserved_3   : 15;   /*!< Reserved bits */
		} C2AHB2ENR_register;
	};


    // RCC CPU2 AHB3 鍜? AHB4 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB3ENR)
		//		0x5800 0150
	union {
		__IO uint32_t C2AHB3ENR;		  /*!< RCC CPU2 AHB3 and AHB4 peripheral clock enable register */
		struct C2AHB3ENR_Register {
			uint32_t Reserved_0   : 16;   /*!< Reserved bits */
			uint32_t PKAEN		  : 1;	  /*!< PKA clock enable */
			uint32_t AES2EN 	  : 1;	  /*!< AES2 clock enable */
			uint32_t RNGEN		  : 1;	  /*!< RNG clock enable */
			uint32_t HSEMEN 	  : 1;	  /*!< HSEM clock enable */
			uint32_t IPCCEN 	  : 1;	  /*!< IPCC clock enable */
			uint32_t Reserved_1   : 4;	  /*!< Reserved bits */
			uint32_t FLASHEN	  : 1;	  /*!< FLASH clock enable */
			uint32_t Reserved_2   : 6;	  /*!< Reserved bits */
		} C2AHB3ENR_register;
	};


    uint32_t RESERVED_9;
    // RCC CPU2 APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 1 (RCC_C2APB1ENR1)
		//		0x5800 0158
		union {
			__IO uint32_t C2APB1ENR1;		  /*!< RCC CPU2 APB1 peripheral clock enable register 1 */
			struct C2APB1ENR1_Register {
				uint32_t TIM2EN 	  : 1;	  /*!< TIM2 clock enable */
				uint32_t Reserved_0   : 8;	  /*!< Reserved bits */
				uint32_t LCDEN		  : 1;	  /*!< LCD clock enable */
				uint32_t RTCAPBEN	  : 1;	  /*!< RTC APB clock enable */
				uint32_t Reserved_1   : 3;	  /*!< Reserved bits */
				uint32_t SPI2EN 	  : 1;	  /*!< SPI2 clock enable */
				uint32_t Reserved_2   : 6;	  /*!< Reserved bits */
				uint32_t I2C1EN 	  : 1;	  /*!< I2C1 clock enable */
				uint32_t Reserved_3   : 1;	  /*!< Reserved bit */
				uint32_t I2C3EN 	  : 1;	  /*!< I2C3 clock enable */
				uint32_t CRSEN		  : 1;	  /*!< CRS clock enable */
				uint32_t Reserved_4   : 1;	  /*!< Reserved bits */
				uint32_t USBEN		  : 1;	  /*!< USB clock enable */
				uint32_t Reserved_5   : 4;	  /*!< Reserved bits */
				uint32_t LPTIM1EN	  : 1;	  /*!< LPTIM1 clock enable */
			} C2APB1ENR1_register;
		};


    // RCC CPU2 APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 2 (RCC_C2APB1ENR2)
    //		0x5800 015C
		union {
			__IO uint32_t C2APB1ENR2;		  /*!< RCC CPU2 APB1 peripheral clock enable register 2 */
			struct C2APB1ENR2_Register {
				uint32_t LPUART1EN	  : 1;	  /*!< LPUART1 clock enable */
				uint32_t Reserved_0   : 4;	  /*!< Reserved bits */
				uint32_t LPTIM2EN	  : 1;	  /*!< LPTIM2 clock enable */
				uint32_t Reserved_1   : 26;   /*!< Reserved bits */
			} C2APB1ENR2_register;
		};


    // RCC CPU2 APB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2APB2ENR)
		//		0x5800 0160
		union {
			__IO uint32_t C2APB2ENR;		  /*!< RCC CPU2 APB2 peripheral clock enable register */
			struct C2APB2ENR_Register {
				uint32_t Reserved_0   : 11;	  /*!< Reserved bit */
				uint32_t TIM1EN 	  : 1;	  /*!< TIM1 clock enable */
				uint32_t SPI1EN 	  : 1;	  /*!< SPI1 clock enable */
				uint32_t Reserved_1   : 1;   /*!< Reserved bits */
				uint32_t USART1EN	  : 1;	  /*!< USART1 clock enable */
				uint32_t Reserved_2   : 2;   /*!< Reserved bits */
				uint32_t TIM16EN	  : 1;	  /*!< TIM16 clock enable */
				uint32_t TIM17EN	  : 1;	  /*!< TIM17 clock enable */
				uint32_t Reserved_3   : 2;	  /*!< Reserved bits */
				uint32_t SAI1EN 	  : 1;	  /*!< SAI1 clock enable */
				uint32_t Reserved_4   : 10;   /*!< Reserved bits */
			} C2APB2ENR_register;
		};

    // RCC CPU2 APB3 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2APB3ENR)
		//		0x5800 0164
		union {
        __IO uint32_t C2APB3ENR;         /*!< RCC CPU2 APB3 peripheral clock enable register */
        struct C2APB3ENR_Register {
            uint32_t BLEEN       : 1;    /*!< BLE interface clock enable for CPU2           */
            uint32_t _802EN		 : 1;    /*!< IEEE 802.15.4 interface clock enable for CPU2 */
            uint32_t Reserved_0  : 30;   /*!< Reserved bits                                 */
        } C2APB3ENR_register;
    };

    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 AHB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB1SMENR)
		//		0x5800 0168
		union {
			__IO uint32_t C2AHB1SMENR;		  /*!< RCC CPU2 AHB1 peripheral clocks enable in Sleep mode register */
			struct C2AHB1SMENR_Register {
				uint32_t DMA1SMEN	  : 1;	  /*!< DMA1 clock enable in Sleep mode */
				uint32_t DMA2SMEN	  : 1;	  /*!< DMA2 clock enable in Sleep mode */
				uint32_t DMAMUX1SMEN  : 1;	  /*!< DMAMUX1 clock enable in Sleep mode */
				uint32_t Reserved_0   : 6;	  /*!< Reserved bits */
				uint32_t SRAM1SMEN	  : 1;	  /*!< SRAM1 clock enable in Sleep mode */
				uint32_t Reserved_1   : 2;	  /*!< Reserved bits */
				uint32_t CRCSMEN	  : 1;	  /*!< CRC clock enable in Sleep mode */
				uint32_t Reserved_2   : 3;	  /*!< Reserved bits */
				uint32_t TSCSMEN	  : 1;	  /*!< TSC clock enable in Sleep mode */
				uint32_t Reserved_3   : 15;   /*!< Reserved bits */
			} C2AHB1SMENR_register;
		};


