TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 AHB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB2SMENR)
		//		0x5800 016C
		union {
			__IO uint32_t C2AHB2SMENR;		  /*!< RCC CPU2 AHB2 peripheral clocks enable in Sleep mode register */
			struct C2AHB2SMENR_Register {
				uint32_t GPIOASMEN	  : 1;	  /*!< GPIOA clock enable in Sleep mode */
				uint32_t GPIOBSMEN	  : 1;	  /*!< GPIOB clock enable in Sleep mode */
				uint32_t GPIOCSMEN	  : 1;	  /*!< GPIOC clock enable in Sleep mode */
				uint32_t GPIODSMEN	  : 1;	  /*!< GPIOD clock enable in Sleep mode */
				uint32_t GPIOESMEN	  : 1;	  /*!< GPIOE clock enable in Sleep mode */
				uint32_t Reserved_0   : 2;	  /*!< Reserved bits */
				uint32_t GPIOHSMEN	  : 1;	  /*!< GPIOH clock enable in Sleep mode */
				uint32_t Reserved_1   : 5;	  /*!< Reserved bits */
				uint32_t ADCSMEN	  : 1;	  /*!< ADC clock enable in Sleep mode */
				uint32_t Reserved_2   : 2;	  /*!< Reserved bits */
				uint32_t AES1SMEN	  : 1;	  /*!< AES1 clock enable in Sleep mode */
				uint32_t Reserved_3   : 15;   /*!< Reserved bits */
			} C2AHB2SMENR_register;
		};


    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 AHB3 鍜? AHB4 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2AHB3SMENR)
		//		0x5800 0170
		union {
			__IO uint32_t C2AHB3SMENR;		  /*!< RCC CPU2 AHB3 and AHB4 peripheral clocks enable in Sleep mode register */
			struct C2AHB3SMENR_Register {
				uint32_t Reserved_0   : 16;   /*!< Reserved bits */
				uint32_t PKASMEN	  : 1;	  /*!< PKA clock enable in Sleep mode */
				uint32_t AES2SMEN	  : 1;	  /*!< AES2 clock enable in Sleep mode */
				uint32_t RNGSMEN	  : 1;	  /*!< RNG clock enable in Sleep mode */
				uint32_t Reserved_1   : 5;	  /*!< Reserved bits */
				uint32_t SRAM2SMEN	  : 1;	  /*!< SRAM2 clock enable in Sleep mode */
				uint32_t FLASHSMEN	  : 1;	  /*!< FLASH clock enable in Sleep mode */
				uint32_t Reserved_2   : 6;	  /*!< Reserved bits */
			} C2AHB3SMENR_register;
		};


    uint32_t RESERVED_10;
    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 1 (RCC_C2APB1SMENR1)
		//		0x5800 0178
		union {
			__IO uint32_t C2APB1SMENR1; 	  /*!< RCC CPU2 APB1 peripheral clocks enable in Sleep mode register 1 */
			struct C2APB1SMENR1_Register {
				uint32_t TIM2SMEN	  : 1;	  /*!< TIM2 clock enable in Sleep mode */
				uint32_t Reserved_0   : 8;	  /*!< Reserved bits */
				uint32_t LCDSMEN	  : 1;	  /*!< LCD clock enable in Sleep mode */
				uint32_t RTCAPBSMEN   : 1;	  /*!< RTC APB clock enable in Sleep mode */
				uint32_t Reserved_1   : 3;	  /*!< Reserved bits */
				uint32_t SPI2SMEN	  : 1;	  /*!< SPI2 clock enable in Sleep mode */
				uint32_t Reserved_2   : 6;	  /*!< Reserved bits */
				uint32_t I2C1SMEN	  : 1;	  /*!< I2C1 clock enable in Sleep mode */
				uint32_t Reserved_3   : 1;	  /*!< Reserved bits */
				uint32_t I2C3SMEN	  : 1;	  /*!< I2C3 clock enable in Sleep mode */
				uint32_t CRSSMEN	  : 1;	  /*!< CRS clock enable in Sleep mode */
				uint32_t Reserved_4   : 1;	  /*!< Reserved bits */
				uint32_t USBSMEN	  : 1;	  /*!< USB clock enable in Sleep mode */
				uint32_t Reserved_5   : 4;	  /*!< Reserved bits */
				uint32_t LPTIM1SMEN   : 1;	  /*!< LPTIM1 clock enable in Sleep mode */
			} C2APB1SMENR1_register;
		};


    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 APB1 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? 2 (RCC_C2APB1SMENR2)
		//		0x5800 017C
		union {
			__IO uint32_t C2APB1SMENR2; 	  /*!< RCC CPU2 APB1 peripheral clocks enable in Sleep mode register 2 */
			struct C2APB1SMENR2_Register {
				uint32_t LPUART1SMEN  : 1;	  /*!< LPUART1 clock enable in Sleep mode */
				uint32_t Reserved_0   : 4;	  /*!< Reserved bits */
				uint32_t LPTIM2SMEN   : 1;	  /*!< LPTIM2 clock enable in Sleep mode */
				uint32_t Reserved_1   : 26;   /*!< Reserved bits */
			} C2APB1SMENR2_register;
		};


    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 APB2 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2APB2SMENR)
		//		0x5800 0180
		union {
			__IO uint32_t C2APB2SMENR;		  /*!< RCC CPU2 APB2 peripheral clocks enable in Sleep mode register */
			struct C2APB2SMENR_Register {
				uint32_t Reserved_0   : 11;	  /*!< Reserved bit */
				uint32_t TIM1SMEN	  : 1;	  /*!< TIM1 clock enable in Sleep mode */
				uint32_t SPI1SMEN	  : 1;	  /*!< SPI1 clock enable in Sleep mode */
				uint32_t Reserved_1   : 1;	  /*!< Reserved bit */
				uint32_t USART1SMEN   : 1;	  /*!< USART1 clock enable in Sleep mode */
				uint32_t Reserved_2   : 2;   /*!< Reserved bits */
				uint32_t TIM16SMEN	  : 1;	  /*!< TIM16 clock enable in Sleep mode */
				uint32_t TIM17SMEN	  : 1;	  /*!< TIM17 clock enable in Sleep mode */
				uint32_t Reserved_3   : 2;	  /*!< Reserved bits */
				uint32_t SAI1SMEN	  : 1;	  /*!< SAI1 clock enable in Sleep mode */
				uint32_t Reserved_4   : 10;   /*!< Reserved bits */
			} C2APB2SMENR_register;
		};


    // 鐫＄湢妯″紡涓嬬殑 RCC CPU2 APB3 澶栬鏃堕挓浣胯兘瀵勫瓨鍣? (RCC_C2APB3SMENR)
		//		0x5800 0184
		union {
			__IO uint32_t C2APB3SMENR;		  /*!< RCC CPU2 APB3 peripheral clock enable in Sleep mode register */
			struct C2APB3SMENR_Register {
				uint32_t BLESMEN	  : 1;	  /*!< BLE clock enable in Sleep mode */
				uint32_t _802S1SMEN	  : 1;	  /*!< 802.15.4 interface bus clock enable in Sleep mode */
				uint32_t Reserved_0   : 30;   /*!< Reserved bits */
			} C2APB3SMENR_register;
		};

} WROS_RCC_TypeDef;








/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/




// 				SYSCFG




