TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
typedef struct {
    // SYSCFG 瀛樺偍鍣ㄩ噸鏄犲皠瀵勫瓨鍣? (SYSCFG_MEMRMP)锛屽亸绉诲湴鍧?锛?0x00
    union {
        __IO uint32_t MEMRMP;
        struct MEMRMP_Register {
            uint32_t MEM_MODE : 3; /*!< 瀛樺偍鍣ㄦ槧灏勯?夋嫨 */
            uint32_t RESERVED0 : 29; /*!< 淇濈暀浣? */
        } MEMRMP_register;
    };

    // SYSCFG 閰嶇疆瀵勫瓨鍣? 1 (SYSCFG_CFGFR1)锛屽亸绉诲湴鍧?锛?0x04
    union {
        __IO uint32_t CFGR1;
        struct CFGR1_Register {
            uint32_t FPU_IE0 : 1; /*!< FPU 鏃犳搷浣滀腑鏂娇鑳? */
            uint32_t FPU_IE1 : 1; /*!< FPU 涓嬫孩涓柇浣胯兘 */
            uint32_t FPU_IE2 : 1; /*!< FPU 涓婃孩涓柇浣胯兘 */
            uint32_t FPU_IE3 : 1; /*!< FPU 杈撳叆闈炲父瑙勪腑鏂娇鑳? */
            uint32_t FPU_IE4 : 1; /*!< FPU 涓嶇簿纭殑涓柇浣胯兘 */
            uint32_t FPU_IE5 : 1; /*!< FPU 杈撳叆寮傚父涓柇浣胯兘 */
            uint32_t RESERVED1 : 1; /*!< 淇濈暀浣? */
            uint32_t BOOST_EN : 1; /*!< BOOST 浣胯兘 */
            uint32_t I2C_PB7_FMP : 1; /*!< I2C_PB7 涓婄殑瓒呭揩閫熸ā寮忛┍鍔ㄥ姛鑳芥縺娲? */
            uint32_t I2C_PB8_FMP : 1; /*!< I2C_PB8 涓婄殑瓒呭揩閫熸ā寮忛┍鍔ㄥ姛鑳芥縺娲? */
            uint32_t I2C_PB9_FMP : 1; /*!< I2C_PB9 涓婄殑瓒呭揩閫熸ā寮忛┍鍔ㄥ姛鑳芥縺娲? */
            uint32_t I2C1_FMP : 1; /*!< I2C1 瓒呭揩閫熸ā寮忛┍鍔ㄥ姛鑳芥縺娲? */
            uint32_t I2C3_FMP : 1; /*!< I2C3 瓒呭揩閫熸ā寮忛┍鍔ㄥ姛鑳芥縺娲? */
            uint32_t RESERVED2 : 19; /*!< 淇濈暀浣? */
        } CFGR1_register;
    };

    // SYSCFG 澶栭儴涓柇閰嶇疆瀵勫瓨鍣? 1 (SYSCFG_EXTICR1)锛屽亸绉诲湴鍧?锛?0x08
    union {
        __IO uint32_t EXTICR1;
        struct EXTICR1_Register {
            uint32_t EXTI0 : 3; /*!< EXTI0 閰嶇疆浣? */
            uint32_t RESERVED3 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI1 : 3; /*!< EXTI1 閰嶇疆浣? */
            uint32_t RESERVED4 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI2 : 3; /*!< EXTI2 閰嶇疆浣? */
            uint32_t RESERVED5 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI3 : 3; /*!< EXTI3 閰嶇疆浣? */
            uint32_t RESERVED6 : 17; /*!< 淇濈暀浣? */
        } EXTICR1_register;
    };

    // SYSCFG 澶栭儴涓柇閰嶇疆瀵勫瓨鍣? 2 (SYSCFG_EXTICR2)锛屽亸绉诲湴鍧?锛?0x0C
    union {
        __IO uint32_t EXTICR2;
        struct EXTICR2_Register {
            uint32_t EXTI4 : 3; /*!< EXTI4 閰嶇疆浣? */
            uint32_t RESERVED7 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI5 : 3; /*!< EXTI5 閰嶇疆浣? */
            uint32_t RESERVED8 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI6 : 3; /*!< EXTI6 閰嶇疆浣? */
            uint32_t RESERVED9 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI7 : 3; /*!< EXTI7 閰嶇疆浣? */
            uint32_t RESERVED10 : 17; /*!< 淇濈暀浣? */
        } EXTICR2_register;
    };

    // SYSCFG 澶栭儴涓柇閰嶇疆瀵勫瓨鍣? 3 (SYSCFG_EXTICR3)锛屽亸绉诲湴鍧?锛?0x10
    union {
        __IO uint32_t EXTICR3;
        struct EXTICR3_Register {
            uint32_t EXTI8 : 3; /*!< EXTI8 閰嶇疆浣? */
            uint32_t RESERVED11 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI9 : 3; /*!< EXTI9 閰嶇疆浣? */
            uint32_t RESERVED12 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI10 : 3; /*!< EXTI10 閰嶇疆浣? */
            uint32_t RESERVED13 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI11 : 3; /*!< EXTI11 閰嶇疆浣? */
            uint32_t RESERVED14 : 17; /*!< 淇濈暀浣? */
        } EXTICR3_register;
    };

    // SYSCFG 澶栭儴涓柇閰嶇疆瀵勫瓨鍣? 4 (SYSCFG_EXTICR4)锛屽亸绉诲湴鍧?锛?0x14
    union {
        __IO uint32_t EXTICR4;
        struct EXTICR4_Register {
            uint32_t EXTI12 : 3; /*!< EXTI12 閰嶇疆浣? */
            uint32_t RESERVED15 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI13 : 3; /*!< EXTI13 閰嶇疆浣? */
            uint32_t RESERVED16 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI14 : 3; /*!< EXTI14 閰嶇疆浣? */
            uint32_t RESERVED17 : 1; /*!< 淇濈暀浣? */
            uint32_t EXTI15 : 3; /*!< EXTI15 閰嶇疆浣? */
            uint32_t RESERVED18 : 17; /*!< 淇濈暀浣? */
        } EXTICR4_register;
    };

    // SYSCFG SRAM2 鎺у埗鍜岀姸鎬佸瘎瀛樺櫒 (SYSCFG_SCSR)锛屽亸绉诲湴鍧?锛?0x18
    union {
        __IO uint32_t SCSR;
        struct SCSR_Register {
            uint32_t SRAM2ER : 1; /*!< SRAM2 鍜? PKA RAM 鎿﹂櫎 */
            uint32_t SRAM2BSY : 1; /*!< SRAM2 鍜? PKA RAM 蹇欎簬鎿﹂櫎鎿嶄綔 */
            uint32_t RESERVED19 : 28; /*!< 淇濈暀浣? */
            uint32_t CFRFD : 1; /*!< CPU2 SRAM 鍙栨寚锛堟墽琛岋級绂佹 */
            uint32_t RESERVED20 : 1; /*!< 淇濈暀浣? */
        } SCSR_register;
    };

    // SYSCFG 閰嶇疆瀵勫瓨鍣? 2 (SYSCFG_CFGFR2)锛屽亸绉诲湴鍧?锛?0x1C
    union {
        __IO uint32_t CFGR2;
        struct CFGR2_Register {
            uint32_t CLL : 1; /*!< CLL */
            uint32_t SPL : 1; /*!< SRAM2 濂囧伓鏍￠獙閿佸畾浣? */
            uint32_t PVDL : 1; /*!< PVD 閿佸畾浣胯兘浣? */
            uint32_t ECCL : 1; /*!< ECC 閿佸畾 */
            uint32_t RESERVED21 : 4; /*!< 淇濈暀浣? */
            uint32_t SPF : 1; /*!< SRAM2 濂囧伓鏍￠獙閿欒鏍囧織 */
            uint32_t RESERVED22 : 24; /*!< 淇濈暀浣? */
        } CFGR2_register;
    };

    // SYSCFG SRAM2 鍐欎繚鎶ゅ瘎瀛樺櫒 (SYSCFG_SWPR1)锛屽亸绉诲湴鍧?锛?0x20
    union {
        __IO uint32_t SWPR1;
        struct SWPR1_Register {
            uint32_t P0WP : 1; /*!< SRAM2 1KB 椤? 0 鍐欎繚鎶? */
            uint32_t P1WP : 1; /*!< SRAM2 1KB 椤? 1 鍐欎繚鎶? */
            uint32_t P2WP : 1; /*!< SRAM2 1KB 椤? 2 鍐欎繚鎶? */
            uint32_t P3WP : 1; /*!< SRAM2 1KB 椤? 3 鍐欎繚鎶? */
            uint32_t P4WP : 1; /*!< SRAM2 1KB 椤? 4 鍐欎繚鎶? */
            uint32_t P5WP : 1; /*!< SRAM2 1KB 椤? 5 鍐欎繚鎶? */
            uint32_t P6WP : 1; /*!< SRAM2 1KB 椤? 6 鍐欎繚鎶? */
            uint32_t P7WP : 1; /*!< SRAM2 1KB 椤? 7 鍐欎繚鎶? */
            uint32_t P8WP : 1; /*!< SRAM2 1KB 椤? 8 鍐欎繚鎶? */
            uint32_t P9WP : 1; /*!< SRAM2 1KB 椤? 9 鍐欎繚鎶? */
            uint32_t P10WP : 1; /*!< SRAM2 1KB 椤? 10 鍐欎繚鎶? */
            uint32_t P11WP : 1; /*!< SRAM2 1KB 椤? 11 鍐欎繚鎶? */
            uint32_t P12WP : 1; /*!< SRAM2 1KB 椤? 12 鍐欎繚鎶? */
            uint32_t P13WP : 1; /*!< SRAM2 1KB 椤? 13 鍐欎繚鎶? */
            uint32_t P14WP : 1; /*!< SRAM2 1KB 椤? 14 鍐欎繚鎶? */
            uint32_t P15WP : 1; /*!< SRAM2 1KB 椤? 15 鍐欎繚鎶? */
            uint32_t P16WP : 1; /*!< SRAM2 1KB 椤? 16 鍐欎繚鎶? */
            uint32_t P17WP : 1; /*!< SRAM2 1KB 椤? 17 鍐欎繚鎶? */
            uint32_t P18WP : 1; /*!< SRAM2 1KB 椤? 18 鍐欎繚鎶? */
            uint32_t P19WP : 1; /*!< SRAM2 1KB 椤? 19 鍐欎繚鎶? */
            uint32_t P20WP : 1; /*!< SRAM2 1KB 椤? 20 鍐欎繚鎶? */
            uint32_t P21WP : 1; /*!< SRAM2 1KB 椤? 21 鍐欎繚鎶? */
            uint32_t P22WP : 1; /*!< SRAM2 1KB 椤? 22 鍐欎繚鎶? */
            uint32_t P23WP : 1; /*!< SRAM2 1KB 椤? 23 鍐欎繚鎶? */
            uint32_t P24WP : 1; /*!< SRAM2 1KB 椤? 24 鍐欎繚鎶? */
            uint32_t P25WP : 1; /*!< SRAM2 1KB 椤? 25 鍐欎繚鎶? */
            uint32_t P26WP : 1; /*!< SRAM2 1KB 椤? 26 鍐欎繚鎶? */
            uint32_t P27WP : 1; /*!< SRAM2 1KB 椤? 27 鍐欎繚鎶? */
            uint32_t P28WP : 1; /*!< SRAM2 1KB 椤? 28 鍐欎繚鎶? */
            uint32_t P29WP : 1; /*!< SRAM2 1KB 椤? 29 鍐欎繚鎶? */
            uint32_t P30WP : 1; /*!< SRAM2 1KB 椤? 30 鍐欎繚鎶? */
            uint32_t P31WP : 1; /*!< SRAM2 1KB 椤? 31 鍐欎繚鎶? */
        } SWPR1_register;
    };

