TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    // SYSCFG SRAM2 瀵嗛挜瀵勫瓨鍣? (SYSCFG_SKR)锛屽亸绉诲湴鍧?锛?0x24
    union {
        __IO uint32_t SKR;
        struct SKR_Register {
            uint32_t KEY : 8; /*!< 杞欢鎿﹂櫎鐨? SRAM2 鍐欎繚鎶ゅ瘑閽? */
            uint32_t RESERVED23 : 24; /*!< 淇濈暀浣? */
        } SKR_register;
    };

    // SYSCFG SRAM2 鍐欎繚鎶ゅ瘎瀛樺櫒 2 (SYSCFG_SWPR2)锛屽亸绉诲湴鍧?锛?0x28
    union {
        __IO uint32_t SWPR2;
        struct SWPR2_Register {
            uint32_t P32WP : 1; /*!< SRAM2 1KB 椤? 32 鍐欎繚鎶? */
            uint32_t P33WP : 1; /*!< SRAM2 1KB 椤? 33 鍐欎繚鎶? */
            uint32_t P34WP : 1; /*!< SRAM2 1KB 椤? 34 鍐欎繚鎶? */
            uint32_t P35WP : 1; /*!< SRAM2 1KB 椤? 35 鍐欎繚鎶? */
            uint32_t P36WP : 1; /*!< SRAM2 1KB 椤? 36 鍐欎繚鎶? */
            uint32_t P37WP : 1; /*!< SRAM2 1KB 椤? 37 鍐欎繚鎶? */
            uint32_t P38WP : 1; /*!< SRAM2 1KB 椤? 38 鍐欎繚鎶? */
            uint32_t P39WP : 1; /*!< SRAM2 1KB 椤? 39 鍐欎繚鎶? */
            uint32_t P40WP : 1; /*!< SRAM2 1KB 椤? 40 鍐欎繚鎶? */
            uint32_t P41WP : 1; /*!< SRAM2 1KB 椤? 41 鍐欎繚鎶? */
            uint32_t P42WP : 1; /*!< SRAM2 1KB 椤? 42 鍐欎繚鎶? */
            uint32_t P43WP : 1; /*!< SRAM2 1KB 椤? 43 鍐欎繚鎶? */
            uint32_t P44WP : 1; /*!< SRAM2 1KB 椤? 44 鍐欎繚鎶? */
            uint32_t P45WP : 1; /*!< SRAM2 1KB 椤? 45 鍐欎繚鎶? */
            uint32_t P46WP : 1; /*!< SRAM2 1KB 椤? 46 鍐欎繚鎶? */
            uint32_t P47WP : 1; /*!< SRAM2 1KB 椤? 47 鍐欎繚鎶? */
            uint32_t P48WP : 1; /*!< SRAM2 1KB 椤? 48 鍐欎繚鎶? */
            uint32_t P49WP : 1; /*!< SRAM2 1KB 椤? 49 鍐欎繚鎶? */
            uint32_t P50WP : 1; /*!< SRAM2 1KB 椤? 50 鍐欎繚鎶? */
            uint32_t P51WP : 1; /*!< SRAM2 1KB 椤? 51 鍐欎繚鎶? */
            uint32_t P52WP : 1; /*!< SRAM2 1KB 椤? 52 鍐欎繚鎶? */
            uint32_t P53WP : 1; /*!< SRAM2 1KB 椤? 53 鍐欎繚鎶? */
            uint32_t P54WP : 1; /*!< SRAM2 1KB 椤? 54 鍐欎繚鎶? */
            uint32_t P55WP : 1; /*!< SRAM2 1KB 椤? 55 鍐欎繚鎶? */
            uint32_t P56WP : 1; /*!< SRAM2 1KB 椤? 56 鍐欎繚鎶? */
            uint32_t P57WP : 1; /*!< SRAM2 1KB 椤? 57 鍐欎繚鎶? */
            uint32_t P58WP : 1; /*!< SRAM2 1KB 椤? 58 鍐欎繚鎶? */
            uint32_t P59WP : 1; /*!< SRAM2 1KB 椤? 59 鍐欎繚鎶? */
            uint32_t P60WP : 1; /*!< SRAM2 1KB 椤? 60 鍐欎繚鎶? */
            uint32_t P61WP : 1; /*!< SRAM2 1KB 椤? 61 鍐欎繚鎶? */
            uint32_t P62WP : 1; /*!< SRAM2 1KB 椤? 62 鍐欎繚鎶? */
            uint32_t P63WP : 1; /*!< SRAM2 1KB 椤? 63 鍐欎繚鎶? */
        } SWPR2_register;
    };

    // 淇濈暀鍖哄煙 (0x2C - 0x0FF)锛岀敤浜庡湴鍧?鍋忕Щ
    __IO uint32_t RESERVED24[53]; /*!< 53涓?32浣嶅瘎瀛樺櫒锛屽亸绉?0x2C鍒?0x0FF */

    // SYSCFG 涓柇灞忚斀瀵勫瓨鍣? 1 (SYSCFG_IMR1)锛屽亸绉诲湴鍧?锛?0x100
    union {
        __IO uint32_t IMR1;
        struct IMR1_Register {
            uint32_t IMR0 : 1; /*!< 涓柇绾?0灞忚斀浣? */
            uint32_t IMR1 : 1; /*!< 涓柇绾?1灞忚斀浣? */
            uint32_t IMR2 : 1; /*!< 涓柇绾?2灞忚斀浣? */
            uint32_t IMR3 : 1; /*!< 涓柇绾?3灞忚斀浣? */
            uint32_t IMR4 : 1; /*!< 涓柇绾?4灞忚斀浣? */
            uint32_t IMR5 : 1; /*!< 涓柇绾?5灞忚斀浣? */
            uint32_t IMR6 : 1; /*!< 涓柇绾?6灞忚斀浣? */
            uint32_t IMR7 : 1; /*!< 涓柇绾?7灞忚斀浣? */
            uint32_t IMR8 : 1; /*!< 涓柇绾?8灞忚斀浣? */
            uint32_t IMR9 : 1; /*!< 涓柇绾?9灞忚斀浣? */
            uint32_t IMR10 : 1; /*!< 涓柇绾?10灞忚斀浣? */
            uint32_t IMR11 : 1; /*!< 涓柇绾?11灞忚斀浣? */
            uint32_t IMR12 : 1; /*!< 涓柇绾?12灞忚斀浣? */
            uint32_t IMR13 : 1; /*!< 涓柇绾?13灞忚斀浣? */
            uint32_t IMR14 : 1; /*!< 涓柇绾?14灞忚斀浣? */
            uint32_t IMR15 : 1; /*!< 涓柇绾?15灞忚斀浣? */
            uint32_t RESERVED25 : 16; /*!< 淇濈暀浣? */
        } IMR1_register;
    };

    // SYSCFG 涓柇灞忚斀瀵勫瓨鍣? 2 (SYSCFG_IMR2)锛屽亸绉诲湴鍧?锛?0x104
    union {
        __IO uint32_t IMR2;
        struct IMR2_Register {
            uint32_t IMR16 : 1; /*!< 涓柇绾?16灞忚斀浣? */
            uint32_t IMR17 : 1; /*!< 涓柇绾?17灞忚斀浣? */
            uint32_t IMR18 : 1; /*!< 涓柇绾?18灞忚斀浣? */
            uint32_t IMR19 : 1; /*!< 涓柇绾?19灞忚斀浣? */
            uint32_t IMR20 : 1; /*!< 涓柇绾?20灞忚斀浣? */
            uint32_t IMR21 : 1; /*!< 涓柇绾?21灞忚斀浣? */
            uint32_t IMR22 : 1; /*!< 涓柇绾?22灞忚斀浣? */
            uint32_t IMR23 : 1; /*!< 涓柇绾?23灞忚斀浣? */
            uint32_t IMR24 : 1; /*!< 涓柇绾?24灞忚斀浣? */
            uint32_t IMR25 : 1; /*!< 涓柇绾?25灞忚斀浣? */
            uint32_t IMR26 : 1; /*!< 涓柇绾?26灞忚斀浣? */
            uint32_t IMR27 : 1; /*!< 涓柇绾?27灞忚斀浣? */
            uint32_t IMR28 : 1; /*!< 涓柇绾?28灞忚斀浣? */
            uint32_t IMR29 : 1; /*!< 涓柇绾?29灞忚斀浣? */
            uint32_t IMR30 : 1; /*!< 涓柇绾?30灞忚斀浣? */
            uint32_t IMR31 : 1; /*!< 涓柇绾?31灞忚斀浣? */
            uint32_t RESERVED26 : 16; /*!< 淇濈暀浣? */
        } IMR2_register;
    };

    // SYSCFG CPU2 涓柇灞忚斀瀵勫瓨鍣? 1 (SYSCFG_C2IMR1)锛屽亸绉诲湴鍧?锛?0x108
    union {
        __IO uint32_t C2IMR1;
        struct C2IMR1_Register {
            uint32_t C2IMR0 : 1; /*!< CPU2 涓柇绾?0灞忚斀浣? */
            uint32_t C2IMR1 : 1; /*!< CPU2 涓柇绾?1灞忚斀浣? */
            uint32_t C2IMR2 : 1; /*!< CPU2 涓柇绾?2灞忚斀浣? */
            uint32_t C2IMR3 : 1; /*!< CPU2 涓柇绾?3灞忚斀浣? */
            uint32_t C2IMR4 : 1; /*!< CPU2 涓柇绾?4灞忚斀浣? */
            uint32_t C2IMR5 : 1; /*!< CPU2 涓柇绾?5灞忚斀浣? */
            uint32_t C2IMR6 : 1; /*!< CPU2 涓柇绾?6灞忚斀浣? */
            uint32_t C2IMR7 : 1; /*!< CPU2 涓柇绾?7灞忚斀浣? */
            uint32_t C2IMR8 : 1; /*!< CPU2 涓柇绾?8灞忚斀浣? */
            uint32_t C2IMR9 : 1; /*!< CPU2 涓柇绾?9灞忚斀浣? */
            uint32_t C2IMR10 : 1; /*!< CPU2 涓柇绾?10灞忚斀浣? */
            uint32_t C2IMR11 : 1; /*!< CPU2 涓柇绾?11灞忚斀浣? */
            uint32_t C2IMR12 : 1; /*!< CPU2 涓柇绾?12灞忚斀浣? */
            uint32_t C2IMR13 : 1; /*!< CPU2 涓柇绾?13灞忚斀浣? */
            uint32_t C2IMR14 : 1; /*!< CPU2 涓柇绾?14灞忚斀浣? */
            uint32_t C2IMR15 : 1; /*!< CPU2 涓柇绾?15灞忚斀浣? */
            uint32_t RESERVED27 : 16; /*!< 淇濈暀浣? */
        } C2IMR1_register;
    };

    // SYSCFG CPU2 涓柇灞忚斀瀵勫瓨鍣? 2 (SYSCFG_C2IMR2)锛屽亸绉诲湴鍧?锛?0x10C
    union {
        __IO uint32_t C2IMR2;
        struct C2IMR2_Register {
            uint32_t C2IMR16 : 1; /*!< CPU2 涓柇绾?16灞忚斀浣? */
            uint32_t C2IMR17 : 1; /*!< CPU2 涓柇绾?17灞忚斀浣? */
            uint32_t C2IMR18 : 1; /*!< CPU2 涓柇绾?18灞忚斀浣? */
            uint32_t C2IMR19 : 1; /*!< CPU2 涓柇绾?19灞忚斀浣? */
            uint32_t C2IMR20 : 1; /*!< CPU2 涓柇绾?20灞忚斀浣? */
            uint32_t C2IMR21 : 1; /*!< CPU2 涓柇绾?21灞忚斀浣? */
            uint32_t C2IMR22 : 1; /*!< CPU2 涓柇绾?22灞忚斀浣? */
            uint32_t C2IMR23 : 1; /*!< CPU2 涓柇绾?23灞忚斀浣? */
            uint32_t C2IMR24 : 1; /*!< CPU2 涓柇绾?24灞忚斀浣? */
            uint32_t C2IMR25 : 1; /*!< CPU2 涓柇绾?25灞忚斀浣? */
            uint32_t C2IMR26 : 1; /*!< CPU2 涓柇绾?26灞忚斀浣? */
            uint32_t C2IMR27 : 1; /*!< CPU2 涓柇绾?27灞忚斀浣? */
            uint32_t C2IMR28 : 1; /*!< CPU2 涓柇绾?28灞忚斀浣? */
            uint32_t C2IMR29 : 1; /*!< CPU2 涓柇绾?29灞忚斀浣? */
            uint32_t C2IMR30 : 1; /*!< CPU2 涓柇绾?30灞忚斀浣? */
            uint32_t C2IMR31 : 1; /*!< CPU2 涓柇绾?31灞忚斀浣? */
            uint32_t RESERVED28 : 16; /*!< 淇濈暀浣? */
        } C2IMR2_register;
    };

    // SYSCFG 瀹夊叏鍏ヤ镜閰嶇疆瀵勫瓨鍣? (SYSCFG_SIPCR)锛屽亸绉诲湴鍧?锛?0x110
    union {
        __IO uint32_t SIPCR;
        struct SIPCR_Register {
            uint32_t SIPL : 2; /*!< 瀹夊叏鍏ヤ镜寮曡剼鐢靛钩 */
            uint32_t SIPOL : 1; /*!< 瀹夊叏鍏ヤ镜寮曡剼鏋佹?? */
            uint32_t SIEN : 1; /*!< 瀹夊叏鍏ヤ镜妫?娴嬩娇鑳? */
            uint32_t SRST : 1; /*!< 瀹夊叏鍏ヤ镜澶嶄綅 */
            uint32_t RESERVED29 : 27; /*!< 淇濈暀浣? */
        } SIPCR_register;
    };
} WROS_SYSCFG_TypeDef;
    



/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/
/***************************************************************************************************************/



