TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
// 				PWR

typedef struct {
    /* -------------------------- 0x000: PWR_CR1 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_CR1;                 /*!< PWR Control Register 1 */
        struct PWR_CR1_Register {
            uint32_t LPMS      : 2;    /*!< Bit 0-1: LPMS[1:0] - Low-power mode selection */
            uint32_t RESERVED0 : 1;    /*!< Bit 2: Reserved */
            uint32_t FPDR      : 1;    /*!< Bit 3: FPDR - Flash power-down in Stop mode */
            uint32_t FDDS      : 1;    /*!< Bit 4: FDDS - Flash deep power-down in Stop mode */
            uint32_t RESERVED1 : 3;    /*!< Bit 5-7: Reserved */
            uint32_t DBP       : 1;    /*!< Bit 8: DBP - Disable backup domain write protection */
            uint32_t RESERVED2 : 1;    /*!< Bit 9: Reserved */
            uint32_t VOS       : 2;    /*!< Bit 10-11: VOS[1:0] - Voltage scaling selection */
            uint32_t RESERVED3 : 2;    /*!< Bit 12-13: Reserved */
            uint32_t LPR       : 1;    /*!< Bit 14: LPR - Low-power run */
            uint32_t RESERVED4 : 17;   /*!< Bit 15-31: Reserved */
        } PWR_CR1_register;
    };

    /* -------------------------- 0x004: PWR_CR2 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_CR2;                 /*!< PWR Control Register 2 */
        struct PWR_CR2_Register {
            uint32_t PLS       : 3;    /*!< Bit 0-2: PLS[2:0] - Power lock status */
            uint32_t RESERVED5 : 1;    /*!< Bit 3: Reserved */
            uint32_t PME       : 1;    /*!< Bit 4: PME - Power management event */
            uint32_t RESERVED6 : 3;    /*!< Bit 5-7: Reserved */
            uint32_t USV       : 1;    /*!< Bit 8: USV - Under-voltage supervision */
            uint32_t RESERVED7 : 23;   /*!< Bit 9-31: Reserved */
        } PWR_CR2_register;
    };

    /* -------------------------- 0x008: PWR_CR3 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_CR3;                 /*!< PWR Control Register 3 */
        struct PWR_CR3_Register {
            uint32_t EWP1      : 1;    /*!< Bit 0: EWP1 - Enable wakeup pin 1 */
            uint32_t EWP2      : 1;    /*!< Bit 1: EWP2 - Enable wakeup pin 2 */
            uint32_t EWP3      : 1;    /*!< Bit 2: EWP3 - Enable wakeup pin 3 */
            uint32_t EWP4      : 1;    /*!< Bit 3: EWP4 - Enable wakeup pin 4 */
            uint32_t EWP5      : 1;    /*!< Bit 4: EWP5 - Enable wakeup pin 5 */
            uint32_t RESERVED8 : 3;    /*!< Bit 5-7: Reserved */
            uint32_t ERRS      : 1;    /*!< Bit 8: ERRS - Enable retention register supply */
            uint32_t RESERVED9 : 3;    /*!< Bit 9-11: Reserved */
            uint32_t APC       : 1;    /*!< Bit 12: APC - Apply pull-up and pull-down configuration */
            uint32_t EBLEA     : 1;    /*!< Bit 13: EBLEA - Enable backup domain low-power */
            uint32_t RESERVED10: 2;    /*!< Bit 14-15: Reserved */
            uint32_t E2SE      : 1;    /*!< Bit 16: E2SE - Enable 2nd security level */
            uint32_t RESERVED11: 3;    /*!< Bit 17-19: Reserved */
            uint32_t EEMUL     : 1;    /*!< Bit 20: EEMUL - Enable internal voltage regulator in deep sleep */
            uint32_t RESERVED12: 11;   /*!< Bit 21-31: Reserved */
        } PWR_CR3_register;
    };

    /* -------------------------- 0x00C: PWR_CR4 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_CR4;                 /*!< PWR Control Register 4 */
        struct PWR_CR4_Register {
            uint32_t WP1       : 1;    /*!< Bit 0: WP1 - Wakeup pin 1 */
            uint32_t WP2       : 1;    /*!< Bit 1: WP2 - Wakeup pin 2 */
            uint32_t WP3       : 1;    /*!< Bit 2: WP3 - Wakeup pin 3 */
            uint32_t RESERVED13: 5;    /*!< Bit 3-7: Reserved */
            uint32_t VRES      : 1;    /*!< Bit 8: VRES - Voltage regulator reset */
            uint32_t RESERVED14: 11;   /*!< Bit 9-19: Reserved */
            uint32_t C2BOOT    : 1;    /*!< Bit 20: C2BOOT - CPU2 boot */
            uint32_t RESERVED15: 11;   /*!< Bit 21-31: Reserved */
        } PWR_CR4_register;
    };

    /* -------------------------- 0x010: PWR_SR1 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_SR1;                 /*!< PWR Status Register 1 */
        struct PWR_SR1_Register {
            uint32_t WUF1      : 1;    /*!< Bit 0: WUF1 - Wakeup flag 1 */
            uint32_t WUF2      : 1;    /*!< Bit 1: WUF2 - Wakeup flag 2 */
            uint32_t WUF3      : 1;    /*!< Bit 2: WUF3 - Wakeup flag 3 */
            uint32_t WUF4      : 1;    /*!< Bit 3: WUF4 - Wakeup flag 4 */
            uint32_t WUF5      : 1;    /*!< Bit 4: WUF5 - Wakeup flag 5 */
            uint32_t RESERVED16: 3;    /*!< Bit 5-7: Reserved */
            uint32_t SMSF      : 1;    /*!< Bit 8: SMSF - Standby flag */
            uint32_t RESERVED17: 3;    /*!< Bit 9-11: Reserved */
            uint32_t BORF      : 1;    /*!< Bit 12: BORF - Brownout reset flag */
            uint32_t CWUF      : 1;    /*!< Bit 13: CWUF - Clear wakeup flag */
            uint32_t RESERVED18: 2;    /*!< Bit 14-15: Reserved */
            uint32_t REGLPF    : 1;    /*!< Bit 16: REGLPF - Regulator low-power flag */
            uint32_t RESERVED19: 3;    /*!< Bit 17-19: Reserved */
            uint32_t SBF       : 1;    /*!< Bit 20: SBF - Standby flag */
            uint32_t B2SAF     : 1;    /*!< Bit 21: B2SAF - Backup domain 2nd security flag */
            uint32_t C85AEF    : 1;    /*!< Bit 22: C85AEF - 85掳C alarm flag */
            uint32_t WUF       : 1;    /*!< Bit 23: WUF - Wakeup flag */
            uint32_t RESERVED20: 8;    /*!< Bit 24-31: Reserved */
        } PWR_SR1_register;
    };

    /* -------------------------- 0x014: PWR_SR2 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_SR2;                 /*!< PWR Status Register 2 */
        struct PWR_SR2_Register {
            uint32_t PDU0      : 1;    /*!< Bit 0: PDU0 - Pull-down for I/O pin 0 */
            uint32_t PDU1      : 1;    /*!< Bit 1: PDU1 - Pull-down for I/O pin 1 */
            uint32_t PDU2      : 1;    /*!< Bit 2: PDU2 - Pull-down for I/O pin 2 */
            uint32_t PDU3      : 1;    /*!< Bit 3: PDU3 - Pull-down for I/O pin 3 */
            uint32_t PDU4      : 1;    /*!< Bit 4: PDU4 - Pull-down for I/O pin 4 */
            uint32_t PDU5      : 1;    /*!< Bit 5: PDU5 - Pull-down for I/O pin 5 */
            uint32_t PDU6      : 1;    /*!< Bit 6: PDU6 - Pull-down for I/O pin 6 */
            uint32_t PDU7      : 1;    /*!< Bit 7: PDU7 - Pull-down for I/O pin 7 */
            uint32_t PDU8      : 1;    /*!< Bit 8: PDU8 - Pull-down for I/O pin 8 */
            uint32_t PDU9      : 1;    /*!< Bit 9: PDU9 - Pull-down for I/O pin 9 */
            uint32_t PDU10     : 1;    /*!< Bit 10: PDU10 - Pull-down for I/O pin 10 */
            uint32_t PDU11     : 1;    /*!< Bit 11: PDU11 - Pull-down for I/O pin 11 */
            uint32_t PDU12     : 1;    /*!< Bit 12: PDU12 - Pull-down for I/O pin 12 */
            uint32_t PDU13     : 1;    /*!< Bit 13: PDU13 - Pull-down for I/O pin 13 */
            uint32_t PDU14     : 1;    /*!< Bit 14: PDU14 - Pull-down for I/O pin 14 */
            uint32_t PDU15     : 1;    /*!< Bit 15: PDU15 - Pull-down for I/O pin 15 */
            uint32_t PU0       : 1;    /*!< Bit 16: PU0 - Pull-up for I/O pin 0 */
            uint32_t PU1       : 1;    /*!< Bit 17: PU1 - Pull-up for I/O pin 1 */
            uint32_t PU2       : 1;    /*!< Bit 18: PU2 - Pull-up for I/O pin 2 */
            uint32_t PU3       : 1;    /*!< Bit 19: PU3 - Pull-up for I/O pin 3 */
            uint32_t PU4       : 1;    /*!< Bit 20: PU4 - Pull-up for I/O pin 4 */
            uint32_t PU5       : 1;    /*!< Bit 21: PU5 - Pull-up for I/O pin 5 */
            uint32_t PU6       : 1;    /*!< Bit 22: PU6 - Pull-up for I/O pin 6 */
            uint32_t PU7       : 1;    /*!< Bit 23: PU7 - Pull-up for I/O pin 7 */
            uint32_t PU8       : 1;    /*!< Bit 24: PU8 - Pull-up for I/O pin 8 */
            uint32_t PU9       : 1;    /*!< Bit 25: PU9 - Pull-up for I/O pin 9 */
            uint32_t PU10      : 1;    /*!< Bit 26: PU10 - Pull-up for I/O pin 10 */
            uint32_t PU11      : 1;    /*!< Bit 27: PU11 - Pull-up for I/O pin 11 */
            uint32_t PU12      : 1;    /*!< Bit 28: PU12 - Pull-up for I/O pin 12 */
            uint32_t PU13      : 1;    /*!< Bit 29: PU13 - Pull-up for I/O pin 13 */
            uint32_t PU14      : 1;    /*!< Bit 30: PU14 - Pull-up for I/O pin 14 */
            uint32_t PU15      : 1;    /*!< Bit 31: PU15 - Pull-up for I/O pin 15 */
        } PWR_SR2_register;
    };

    /* -------------------------- 0x018: PWR_SCR 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_SCR;                 /*!< PWR Status Clear Register */
        struct PWR_SCR_Register {
            uint32_t CWUF1     : 1;    /*!< Bit 0: CWUF1 - Clear wakeup flag 1 */
            uint32_t CWUF2     : 1;    /*!< Bit 1: CWUF2 - Clear wakeup flag 2 */
            uint32_t CWUF3     : 1;    /*!< Bit 2: CWUF3 - Clear wakeup flag 3 */
            uint32_t CWUF4     : 1;    /*!< Bit 3: CWUF4 - Clear wakeup flag 4 */
            uint32_t CWUF5     : 1;    /*!< Bit 4: CWUF5 - Clear wakeup flag 5 */
            uint32_t RESERVED21: 3;    /*!< Bit 5-7: Reserved */
            uint32_t CSMF      : 1;    /*!< Bit 8: CSMF - Clear standby flag */
            uint32_t RESERVED22: 3;    /*!< Bit 9-11: Reserved */
            uint32_t CBORF     : 1;    /*!< Bit 12: CBORF - Clear brownout reset flag */
            uint32_t CWUF      : 1;    /*!< Bit 13: CWUF - Clear wakeup flag */
            uint32_t RESERVED23: 2;    /*!< Bit 14-15: Reserved */
            uint32_t CREGLPF   : 1;    /*!< Bit 16: CREGLPF - Clear regulator low-power flag */
            uint32_t RESERVED24: 3;    /*!< Bit 17-19: Reserved */
            uint32_t CSBF      : 1;    /*!< Bit 20: CSBF - Clear standby flag */
            uint32_t CB2SAF    : 1;    /*!< Bit 21: CB2SAF - Clear backup domain 2nd security flag */
            uint32_t CC85AEF   : 1;    /*!< Bit 22: CC85AEF - Clear 85掳C alarm flag */
            uint32_t CWUF_GLOBAL:1;    /*!< Bit 23: CWUF_GLOBAL - Clear global wakeup flag */
            uint32_t RESERVED25: 8;    /*!< Bit 24-31: Reserved */
        } PWR_SCR_register;
    };

