TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    /* -------------------------- 0x01C: PWR_CR5 瀵勫瓨鍣? ------------------------- */
    union {
        __IO uint32_t PWR_CR5;                 /*!< PWR Control Register 5 */
        struct PWR_CR5_Register {
            uint32_t VOS3      : 2;    /*!< Bit 0-1: VOS3[1:0] - Voltage scaling 3 selection */
            uint32_t SMPS      : 3;    /*!< Bit 2-4: SMPS[2:0] - SMPS configuration */
            uint32_t RESERVED26: 3;    /*!< Bit 5-7: Reserved */
            uint32_t BORHC     : 1;    /*!< Bit 8: BORHC - Brownout reset high threshold */
            uint32_t RESERVED27: 11;   /*!< Bit 9-19: Reserved */
            uint32_t SNSEN     : 1;    /*!< Bit 20: SNSEN - Sensor enable */
            uint32_t RESERVED28: 11;   /*!< Bit 21-31: Reserved */
        } PWR_CR5_register;
    };

    /* -------------------------- 0x020: PWR_PUCRA 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PUCRA;               /*!< PWR Pull-up Control Register A */
        struct PUCRA_Register {
            uint32_t PU0       : 1;    /*!< Bit 0: PU0 - Pull-up for PA0 */
            uint32_t PU1       : 1;    /*!< Bit 1: PU1 - Pull-up for PA1 */
            uint32_t PU2       : 1;    /*!< Bit 2: PU2 - Pull-up for PA2 */
            uint32_t PU3       : 1;    /*!< Bit 3: PU3 - Pull-up for PA3 */
            uint32_t PU4       : 1;    /*!< Bit 4: PU4 - Pull-up for PA4 */
            uint32_t PU5       : 1;    /*!< Bit 5: PU5 - Pull-up for PA5 */
            uint32_t PU6       : 1;    /*!< Bit 6: PU6 - Pull-up for PA6 */
            uint32_t PU7       : 1;    /*!< Bit 7: PU7 - Pull-up for PA7 */
            uint32_t PU8       : 1;    /*!< Bit 8: PU8 - Pull-up for PA8 */
            uint32_t PU9       : 1;    /*!< Bit 9: PU9 - Pull-up for PA9 */
            uint32_t PU10      : 1;    /*!< Bit 10: PU10 - Pull-up for PA10 */
            uint32_t PU11      : 1;    /*!< Bit 11: PU11 - Pull-up for PA11 */
            uint32_t PU12      : 1;    /*!< Bit 12: PU12 - Pull-up for PA12 */
            uint32_t PU13      : 1;    /*!< Bit 13: PU13 - Pull-up for PA13 */
            uint32_t PU14      : 1;    /*!< Bit 14: PU14 - Pull-up for PA14 */
            uint32_t PU15      : 1;    /*!< Bit 15: PU15 - Pull-up for PA15 */
            uint32_t RESERVED29: 16;   /*!< Bit 16-31: Reserved */
        } PUCRA_register;
    };

    /* -------------------------- 0x024: PWR_PDCRA 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PDCRA;               /*!< PWR Pull-down Control Register A */
        struct PDCRA_Register {
            uint32_t PD0       : 1;    /*!< Bit 0: PD0 - Pull-down for PA0 */
            uint32_t PD1       : 1;    /*!< Bit 1: PD1 - Pull-down for PA1 */
            uint32_t PD2       : 1;    /*!< Bit 2: PD2 - Pull-down for PA2 */
            uint32_t PD3       : 1;    /*!< Bit 3: PD3 - Pull-down for PA3 */
            uint32_t PD4       : 1;    /*!< Bit 4: PD4 - Pull-down for PA4 */
            uint32_t PD5       : 1;    /*!< Bit 5: PD5 - Pull-down for PA5 */
            uint32_t PD6       : 1;    /*!< Bit 6: PD6 - Pull-down for PA6 */
            uint32_t PD7       : 1;    /*!< Bit 7: PD7 - Pull-down for PA7 */
            uint32_t PD8       : 1;    /*!< Bit 8: PD8 - Pull-down for PA8 */
            uint32_t PD9       : 1;    /*!< Bit 9: PD9 - Pull-down for PA9 */
            uint32_t PD10      : 1;    /*!< Bit 10: PD10 - Pull-down for PA10 */
            uint32_t PD11      : 1;    /*!< Bit 11: PD11 - Pull-down for PA11 */
            uint32_t PD12      : 1;    /*!< Bit 12: PD12 - Pull-down for PA12 */
            uint32_t PD13      : 1;    /*!< Bit 13: PD13 - Pull-down for PA13 */
            uint32_t PD14      : 1;    /*!< Bit 14: PD14 - Pull-down for PA14 */
            uint32_t PD15      : 1;    /*!< Bit 15: PD15 - Pull-down for PA15 */
            uint32_t RESERVED30: 16;   /*!< Bit 16-31: Reserved */
        } PDCRA_register;
    };

    /* -------------------------- 0x028: PWR_PUCRB 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PUCRB;               /*!< PWR Pull-up Control Register B */
        struct PUCRB_Register {
            uint32_t PU0       : 1;    /*!< Bit 0: PU0 - Pull-up for PB0 */
            uint32_t PU1       : 1;    /*!< Bit 1: PU1 - Pull-up for PB1 */
            uint32_t PU2       : 1;    /*!< Bit 2: PU2 - Pull-up for PB2 */
            uint32_t PU3       : 1;    /*!< Bit 3: PU3 - Pull-up for PB3 */
            uint32_t PU4       : 1;    /*!< Bit 4: PU4 - Pull-up for PB4 */
            uint32_t PU5       : 1;    /*!< Bit 5: PU5 - Pull-up for PB5 */
            uint32_t PU6       : 1;    /*!< Bit 6: PU6 - Pull-up for PB6 */
            uint32_t PU7       : 1;    /*!< Bit 7: PU7 - Pull-up for PB7 */
            uint32_t PU8       : 1;    /*!< Bit 8: PU8 - Pull-up for PB8 */
            uint32_t PU9       : 1;    /*!< Bit 9: PU9 - Pull-up for PB9 */
            uint32_t PU10      : 1;    /*!< Bit 10: PU10 - Pull-up for PB10 */
            uint32_t PU11      : 1;    /*!< Bit 11: PU11 - Pull-up for PB11 */
            uint32_t PU12      : 1;    /*!< Bit 12: PU12 - Pull-up for PB12 */
            uint32_t PU13      : 1;    /*!< Bit 13: PU13 - Pull-up for PB13 */
            uint32_t PU14      : 1;    /*!< Bit 14: PU14 - Pull-up for PB14 */
            uint32_t PU15      : 1;    /*!< Bit 15: PU15 - Pull-up for PB15 */
            uint32_t RESERVED31: 16;   /*!< Bit 16-31: Reserved */
        } PUCRB_register;
    };

    /* -------------------------- 0x02C: PWR_PDCRB 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PDCRB;               /*!< PWR Pull-down Control Register B */
        struct PDCRB_Register {
            uint32_t PD0       : 1;    /*!< Bit 0: PD0 - Pull-down for PB0 */
            uint32_t PD1       : 1;    /*!< Bit 1: PD1 - Pull-down for PB1 */
            uint32_t PD2       : 1;    /*!< Bit 2: PD2 - Pull-down for PB2 */
            uint32_t PD3       : 1;    /*!< Bit 3: PD3 - Pull-down for PB3 */
            uint32_t PD4       : 1;    /*!< Bit 4: PD4 - Pull-down for PB4 */
            uint32_t PD5       : 1;    /*!< Bit 5: PD5 - Pull-down for PB5 */
            uint32_t PD6       : 1;    /*!< Bit 6: PD6 - Pull-down for PB6 */
            uint32_t PD7       : 1;    /*!< Bit 7: PD7 - Pull-down for PB7 */
            uint32_t PD8       : 1;    /*!< Bit 8: PD8 - Pull-down for PB8 */
            uint32_t PD9       : 1;    /*!< Bit 9: PD9 - Pull-down for PB9 */
            uint32_t PD10      : 1;    /*!< Bit 10: PD10 - Pull-down for PB10 */
            uint32_t PD11      : 1;    /*!< Bit 11: PD11 - Pull-down for PB11 */
            uint32_t PD12      : 1;    /*!< Bit 12: PD12 - Pull-down for PB12 */
            uint32_t PD13      : 1;    /*!< Bit 13: PD13 - Pull-down for PB13 */
            uint32_t PD14      : 1;    /*!< Bit 14: PD14 - Pull-down for PB14 */
            uint32_t PD15      : 1;    /*!< Bit 15: PD15 - Pull-down for PB15 */
            uint32_t RESERVED32: 16;   /*!< Bit 16-31: Reserved */
        } PDCRB_register;
    };

    /* -------------------------- 0x030: PWR_PUCRC 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PUCRC;               /*!< PWR Pull-up Control Register C */
        struct PUCRC_Register {
            uint32_t PU0       : 1;    /*!< Bit 0: PU0 - Pull-up for PC0 */
            uint32_t PU1       : 1;    /*!< Bit 1: PU1 - Pull-up for PC1 */
            uint32_t PU2       : 1;    /*!< Bit 2: PU2 - Pull-up for PC2 */
            uint32_t PU3       : 1;    /*!< Bit 3: PU3 - Pull-up for PC3 */
            uint32_t PU4       : 1;    /*!< Bit 4: PU4 - Pull-up for PC4 */
            uint32_t PU5       : 1;    /*!< Bit 5: PU5 - Pull-up for PC5 */
            uint32_t PU6       : 1;    /*!< Bit 6: PU6 - Pull-up for PC6 */
            uint32_t PU7       : 1;    /*!< Bit 7: PU7 - Pull-up for PC7 */
            uint32_t PU8       : 1;    /*!< Bit 8: PU8 - Pull-up for PC8 */
            uint32_t PU9       : 1;    /*!< Bit 9: PU9 - Pull-up for PC9 */
            uint32_t PU10      : 1;    /*!< Bit 10: PU10 - Pull-up for PC10 */
            uint32_t PU11      : 1;    /*!< Bit 11: PU11 - Pull-up for PC11 */
            uint32_t PU12      : 1;    /*!< Bit 12: PU12 - Pull-up for PC12 */
            uint32_t PU13      : 1;    /*!< Bit 13: PU13 - Pull-up for PC13 */
            uint32_t PU14      : 1;    /*!< Bit 14: PU14 - Pull-up for PC14 */
            uint32_t PU15      : 1;    /*!< Bit 15: PU15 - Pull-up for PC15 */
            uint32_t RESERVED33: 16;   /*!< Bit 16-31: Reserved */
        } PUCRC_register;
    };

