TheLunarSociety/Program/1.0/STM32/STM32CubeWB/branches/BT_JIg/WROS/Include/WROS_Register.h
    /* -------------------------- 0x034: PWR_PDCRC 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PDCRC;               /*!< PWR Pull-down Control Register C */
        struct PDCRC_Register {
            uint32_t PD0       : 1;    /*!< Bit 0: PD0 - Pull-down for PC0 */
            uint32_t PD1       : 1;    /*!< Bit 1: PD1 - Pull-down for PC1 */
            uint32_t PD2       : 1;    /*!< Bit 2: PD2 - Pull-down for PC2 */
            uint32_t PD3       : 1;    /*!< Bit 3: PD3 - Pull-down for PC3 */
            uint32_t PD4       : 1;    /*!< Bit 4: PD4 - Pull-down for PC4 */
            uint32_t PD5       : 1;    /*!< Bit 5: PD5 - Pull-down for PC5 */
            uint32_t PD6       : 1;    /*!< Bit 6: PD6 - Pull-down for PC6 */
            uint32_t PD7       : 1;    /*!< Bit 7: PD7 - Pull-down for PC7 */
            uint32_t PD8       : 1;    /*!< Bit 8: PD8 - Pull-down for PC8 */
            uint32_t PD9       : 1;    /*!< Bit 9: PD9 - Pull-down for PC9 */
            uint32_t PD10      : 1;    /*!< Bit 10: PD10 - Pull-down for PC10 */
            uint32_t PD11      : 1;    /*!< Bit 11: PD11 - Pull-down for PC11 */
            uint32_t PD12      : 1;    /*!< Bit 12: PD12 - Pull-down for PC12 */
            uint32_t PD13      : 1;    /*!< Bit 13: PD13 - Pull-down for PC13 */
            uint32_t PD14      : 1;    /*!< Bit 14: PD14 - Pull-down for PC14 */
            uint32_t PD15      : 1;    /*!< Bit 15: PD15 - Pull-down for PC15 */
            uint32_t RESERVED34: 16;   /*!< Bit 16-31: Reserved */
        } PDCRC_register;
    };

 /* -------------------------- 0x038: PWR_PUCRD 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PUCRD;               /*!< PWR Pull-up Control Register D */
        struct PUCRD_Register {
            uint32_t PU0       : 1;    /*!< Bit 0: PU0 - Pull-up for PD0 */
            uint32_t PU1       : 1;    /*!< Bit 1: PU1 - Pull-up for PD1 */
            uint32_t PU2       : 1;    /*!< Bit 2: PU2 - Pull-up for PD2 */
            uint32_t PU3       : 1;    /*!< Bit 3: PU3 - Pull-up for PD3 */
            uint32_t PU4       : 1;    /*!< Bit 4: PU4 - Pull-up for PD4 */
            uint32_t PU5       : 1;    /*!< Bit 5: PU5 - Pull-up for PD5 */
            uint32_t PU6       : 1;    /*!< Bit 6: PU6 - Pull-up for PD6 */
            uint32_t PU7       : 1;    /*!< Bit 7: PU7 - Pull-up for PD7 */
            uint32_t PU8       : 1;    /*!< Bit 8: PU8 - Pull-up for PD8 */
            uint32_t PU9       : 1;    /*!< Bit 9: PU9 - Pull-up for PD9 */
            uint32_t PU10      : 1;    /*!< Bit 10: PU10 - Pull-up for PD10 */
            uint32_t PU11      : 1;    /*!< Bit 11: PU11 - Pull-up for PD11 */
            uint32_t PU12      : 1;    /*!< Bit 12: PU12 - Pull-up for PD12 */
            uint32_t PU13      : 1;    /*!< Bit 13: PU13 - Pull-up for PD13 */
            uint32_t PU14      : 1;    /*!< Bit 14: PU14 - Pull-up for PD14 */
            uint32_t PU15      : 1;    /*!< Bit 15: PU15 - Pull-up for PD15 */
            uint32_t RESERVED35: 16;   /*!< Bit 16-31: Reserved */
        } PUCRD_register;
    };

    /* -------------------------- 0x03C: PWR_PDCRD 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PDCRD;               /*!< PWR Pull-down Control Register D */
        struct PDCRD_Register {
            uint32_t PD0       : 1;    /*!< Bit 0: PD0 - Pull-down for PD0 */
            uint32_t PD1       : 1;    /*!< Bit 1: PD1 - Pull-down for PD1 */
            uint32_t PD2       : 1;    /*!< Bit 2: PD2 - Pull-down for PD2 */
            uint32_t PD3       : 1;    /*!< Bit 3: PD3 - Pull-down for PD3 */
            uint32_t PD4       : 1;    /*!< Bit 4: PD4 - Pull-down for PD4 */
            uint32_t PD5       : 1;    /*!< Bit 5: PD5 - Pull-down for PD5 */
            uint32_t PD6       : 1;    /*!< Bit 6: PD6 - Pull-down for PD6 */
            uint32_t PD7       : 1;    /*!< Bit 7: PD7 - Pull-down for PD7 */
            uint32_t PD8       : 1;    /*!< Bit 8: PD8 - Pull-down for PD8 */
            uint32_t PD9       : 1;    /*!< Bit 9: PD9 - Pull-down for PD9 */
            uint32_t PD10      : 1;    /*!< Bit 10: PD10 - Pull-down for PD10 */
            uint32_t PD11      : 1;    /*!< Bit 11: PD11 - Pull-down for PD11 */
            uint32_t PD12      : 1;    /*!< Bit 12: PD12 - Pull-down for PD12 */
            uint32_t PD13      : 1;    /*!< Bit 13: PD13 - Pull-down for PD13 */
            uint32_t PD14      : 1;    /*!< Bit 14: PD14 - Pull-down for PD14 */
            uint32_t PD15      : 1;    /*!< Bit 15: PD15 - Pull-down for PD15 */
            uint32_t RESERVED36: 16;   /*!< Bit 16-31: Reserved */
        } PDCRD_register;
    };

    /* -------------------------- 0x040: PWR_PUCRE 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PUCRE;               /*!< PWR Pull-up Control Register E */
        struct PUCRE_Register {
            uint32_t PU0       : 1;    /*!< Bit 0: PU0 - Pull-up for PE0 */
            uint32_t PU1       : 1;    /*!< Bit 1: PU1 - Pull-up for PE1 */
            uint32_t PU2       : 1;    /*!< Bit 2: PU2 - Pull-up for PE2 */
            uint32_t PU3       : 1;    /*!< Bit 3: PU3 - Pull-up for PE3 */
            uint32_t PU4       : 1;    /*!< Bit 4: PU4 - Pull-up for PE4 */
            uint32_t RESERVED37: 27;   /*!< Bit 5-31: Reserved */
        } PUCRE_register;
    };

    /* -------------------------- 0x044: PWR_PDCRE 瀵勫瓨鍣? ----------------------- */
    union {
        __IO uint32_t PDCRE;               /*!< PWR Pull-dow
